[{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXZMHXZGBP&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    Hi friends,<br>\n<br>\nMy info should help you decide making the right choice.!<br>\n<br>\n♦Cons:<br>\nNo in built FM<br>\n12(Actually 12.28) GB is all you to get to play around with your files and Data.<br>\nNo micro SD slot(Non-expandable storage)<br>\nLoudspeaker is on the quiet side<br>\nNon user-replaceable battery<br>\nComparatively less battery life<br>\nLow Light Camera is 7.5/10<br>\n<br>\n♦Pros:<br>\n10/10 Most affordable phone with fastest Qualcomm Snapdragon 800 chipset till the date.<br>\n10/10 \"Ok Google\" that is Google Now is much smarter now!!<br>\n10/10 First to get Google Android updates<br>\n10/10 Extremely fair Pricing<br>\n10/10 Excellent Display<br>\n10/10 Classy Design<br>\n8.5/10 Good call quality<br>\n9/10 Catches WIFI Signal even at relatively long distances<br>\n8/10 Battery Backup lasts for a around ~2 days<br>\n8.5/10 Music Quality<br>\n10/10 Hassle free stream of 1080p HD Movies<br>\n10/10 No lags on HD Games<br>\n9/10 Voice dialing works without internet/data and understands neutral Indian Accents flawlessly<br>\n9/10 Camera with optical image stabilization also Photo Spehere (360 degrees photo-shot) and 180 degrees Panorama shot very decent<br>\n8.5/10 USB host support, USB on-the-go support this time (Third party apps can give full support)<br>\n<br>\nSo overall this is really Beast phone that if you want to purchase the Best phone in this budget then this is the only choice I think!<br>\nYou don't need a film star to promote this phone.<br>\nPeople who use it will recommend this to their friends and family.!                                </span>", "<span class=\"review-text\">\n                                    I didn't buy this on fipkart as it was not available then , i am writing this review after using the phone for 10 days. I have also got the kitkat update 4.4.2 . <br>\n<br>\npros :<br>\n<br>\na). The processor is a beast. it handles anything very smoothly , without a single lag.<br>\nb). the screen is awesome. you would love to watch movies &amp; pictures in this phone. the 4.95 inch screen full hd screen with 445 ppi is the best you can have.<br>\nc). adreno 330 gpu does amazing work in handling all the graphics<br>\nd). 2gb ram <br>\ne) kitkat gives a wonderful android experience<br>\nf) camera is good , may not be the best in low lighting otherwise good, specially after the update . The HDR+ feature works very nicely.<br>\ng) if you love gaming , then you will love the phone .<br>\nh) reading news &amp; magazines feels great in this phone due to the large screen with high resolution. <br>\ni) it is very light . back panel gives a nice grip.<br>\n<br>\ncons <br>\n<br>\na) the major con is the battery. it has a battery of 2300 mah , which is normally good. but this phone has a 5inch screen with full HD, so the sreen drains a lot of battery. nexus 4 had 2100 mah battery. Nexus 5 should have a maor jump in battery. LG G2 has a 3000 mah battery which has the same processor &amp; a 5.2 inch screen. Something like that would have been better. But it still manages to give backup for nearly a day.<br>\nb) auto brightness of the phone works too well. it gives you more brightness than required , eventually draining your battery<br>\nc) the speaker sound is very clear but a bit low. could have been better.<br>\nd) auto rotation feature of screen sometimes doesn't work that well, it is very rare though.<br>\n<br>\nTIPS for saving battery<br>\n<br>\n1) switch off wifi scanning(this is a feature to scan for wifi even if the the wifi is off)<br>\n2) don't use auto brightness , use manual instead<br>\n3) switch to 3G/2G if you are not using LTE network<br>\n4) turn on locations(GPS) only when required.<br>\n<br>\nI would suggest to buy this phone as it is a great deal at this price. I would give it a 5 star only if they would have given a more powerful battery                                </span>", "<span class=\"review-text\">\n                                    i have being using this phone for a month now.. and i must say i just love it..<br>\nit can process anything in not in a second but in millisecond<br>\n<br>\nscreen is awesome, with a very crisp display with 441ppi<br>\nwith adreno 330 gpu the gaming experience is top class..<br>\n<br>\nwith the barometer support phone gives the location accurate by a metre and makes navigation easy.<br>\n<br>\ncharging time is good, it can get fully charged in about 2 hours using standard travel charger, never tried wireless charging though<br>\n<br>\nand the headphones are pretty good and can hear it clearly even during travelling in a bus or train.. the loudspeakers are also loud enough with about 68db<br>\n<br>\nWiFi signal locking on pretty good, it can catch on the signal at 30-40 ft from router.<br>\nthe tethering speed on all modes (USB,WiFi,Bluetooth) is pretty fast<br>\n<br>\nif any calls from unknown number is received it shows the location of number searching from Google instantaneously..at-least you can guess who it might be..that is a pretty nice feature.. don't know if it is available in other phones<br>\n<br>\nslimport support is far more better than MHL. you dont need an additional power cable like in the case of MHL.. you just need to plug in an go..<br>\n <br>\ngoogle voice search is correct most of the time and i am enjoying this feature..<br>\n<br>\nonly downside is the battery. it last only for about 12 hours. it is mainly due to powerfull screen..<br>\ncamera options are less.nevertheless you can download the camera app from google play store<br>\n<br>\nthats it for now. will let you know more later..                                </span>", "<span class=\"review-text\">\n                                    I don't know if there is a problem with batch of Nexus 5 smartphones that WS Retail has or I am unlucky to receive a faulty device twice !!<br>\nNexus 5 is a fabulous device except for the fact that there are serious call quality issues with it.<br>\nSometimes I don't hear the other person's voice sometimes the other person is not able to hear me clearly !! <br>\nI ave also gone for a replacement of the device. Still the problem exists. I have even tried all the troubleshooting steps including reset the phone and booting into safe and have even changed the SIM ( tried of a diff network just to check if there is an issue with my network) !!<br>\nStill things are the same !!! This is really frustating !!<br>\nProbably will go for another replacement !!                                </span>", "<span class=\"review-text\">\n                                    Been using this fone for a month now...i must say i'm really satisfied with. I like it..its really fast..actually buttery smooth, no lag whatsoever..i like everything about the fone..be its screen , display, touch, processor...i downloaded some heavy games like iron man3 fifa14 asphalt 8 and it played them really well..its gaming graphics are best..and in the middle of the game if u press home it loads in nanoseconds..no wait or lag at all unlike other fones....it has stock android 4.4.2..no unnecessary apps..you can download any damn app from play store...i liked that notification toggles in Samsung fones in which u can turn WiFi Bluetooth data connection on and off...that thing was missing in my nexus but i found a app for that also on play store...its display is good also..very bright n gives true colors...i also liked its corning gorilla glass 3 screen..used it fora month so far and i don't have a single scratch on it..though i keep it carefully all the time...<br>\nThe only thing that disappoints me about this fone is its average camera..fone in this budget deserves a better camera...i'm not saying camera is bad..bt it js gives average shots..and you have to make required settings manually to get a good shot...plus battery is just average...<br>\nPros: Display ...............................10/10<br>\n         Processor ...........................10/10<br>\n         RAM....................................10/10<br>\n         Design/Looks/Weight/Slim.....10/10<br>\n         <br>\nCons: Camera................................7/10<br>\n          Battery.................................7/10<br>\n          Sound Quality.......................8/10 (lacks lil bass)<br>\n          Sound Loudness....................7/10 (if you are in noisy environment sound loudness gets dull)<br>\n<br>\nThis fones compares with Samsung's S4..HTC's One..Sony's Z1..Apple's Iphone 5s....With alot of personal research, among all these fones i went for Nexus5 and i'm happy with my decision..... <br>\n<br>\nI was afraid to buy 30k fone from flipkart, was worried about its genuinity n other things but kudos to flipkart...im 100% satisfied with product!!<br>\n<br>\nThis fones feels delicate..so slim n light weight that i had a feeling if i'll drop it, it will break badly so i bought cruzerlite  back cover now my fone feels rock hard....just saying..                                </span>", "<span class=\"review-text\">\n                                    I agree that the technical specs of the product and great, pricewise I am not sure if 30K is cheap as what every one feels is really cheap.<br>\n<br>\nBut anyways, my biggest concern with this device is call quality. If you read on the net, you will find enough issues and google doesn't seem to know/have any clue on the fix. What I have faced:<br>\n1. People whom I call say they hear hissing noise, words get broken/go missing<br>\n2. Can't hear or the voice feels muffled.<br>\n3. This happens especially when you are connected via headset provided with the device or while connected through the incar BT audio (like in Figo)<br>\n4. I have tried Samsung S4 headset and even those seem to have same problems with this device<br>\n<br>\nI complained and google did replace the device with a new one, but unfortunately the problems are not gone. I have been using a Nokia N8, S4 and iPhone and have never faced these issues. The calls I make have been on the same locality, so we can rule out signal issues. <br>\n<br>\nSo if you are planning to buy this device paying 30K, keep in mind these call related issues. I would suggest you read the other writeups on the net and you will know this is not a one off case and there are generic call related issues with this device. <br>\n<br>\nSo a great phone with best specs but cannot make good quality phone calls. BTW, google offers refund policy in USA but not in India.                                </span>", "<span class=\"review-text\">\n                                    Have been Using this phone for more than a Week Now, must say I am very impressed with it.The processor is Super fast and the 2GB RAM makes sure, apps never Lag no matter what. The touch is one of the best in a smartphone. Android Kitkat is simply awesome, very smooth UI and Nexus will b always first to get the Updates, what more can you ask for?<br>\nThe Display is FULL HD (445 ppi), the clarity is simply superb. The battery lasts about a Day with Moderate usage, but with heavy usage will last for about 12-15 Hours. All in all, you can't ask for a better phone under 30k. Did I also mention how light the phone is? It's so light that u don't even feel it in you hands! <br>\nIf your Budget is 30k, go get this phone, don't even think twice!                                </span>", "<span class=\"review-text\">\n                                    hi,<br>\ni have been facing some problems with the nexus.its been 2 months now and initially i thought it could be the network but its not.the problem is that there is a lot of call drops all the time,a call doesnot go at the 1st dial.mostly have to dial again.the touch screen doesnt respond at times...kindly help...                                </span>", "<span class=\"review-text\">\n                                    Loving the phone, everything is good about it, not going to waste your time reviewing the phone. <br>\nThe delivery time of flipkart was satisfactory, but the product I received had a faulty display - The whites looked yellowish and I had to get it replaced and to my disappointment the second piece had a good display but the front camera was defective and not aligned. Poor quality, maybe reviews stating flipkart buys refurbished/defective products for cheap from companies is true. <br>\n<br>\nRating 2 cause of the quality of products.                                </span>", "<span class=\"review-text\">\n                                    play store price at 28,999 /- so whats the use buying from flipkart...costing 1k more.......................................                                </span>"]}]