[[{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    I have been using this phone for over 3 months and its excellent in operations but a slight fall from ur lap broke its screen which costed Rs.7040.<br>\nNow remember that such falls are inevitable in daily usage and do expect to shell out few extra thousands in hlf a year or so on an avg.<br>\nLG please get a better quality Gorilla Glass                                </span>", "<span class=\"review-text\">\n                                    Just brought the 16gb Nexus 5 for 29500 at a local mobile store, &amp; all I was able to say at holding this set was wow.<br>\nDesign-10/10 I have used sammy phones &amp; still using one my past phones are galaxy ace duos,galaxy s duos &amp; galaxy grand all those phones look the same &amp; this phone its a killer as per looks &amp; usabilty goes.<br>\nPerformance- Dont let antutu &amp; Quadrant fool you it scores less compared to any other snapdragon 800 phones beacause google doesn't cheat.The phone is blazing fast using for 15 days &amp; never froze.<br>\nGaming- The best gaming phone out there still tested Asphalt 8,riptime GP 2 &amp; NFS mw all ran at highest setting &amp; flawlessly.<br>\nScreen- The screen is for a person who admires the natural colours &amp; knows about screen calibration because the screen only renders colours true to life not providing you oversaturated colours, for those people who want red to be the brightest red like sammy phones then the screen is not yours opt for bloated shit sammy phone which will provide you no core android experience &amp; make u live in world where the colours are overlysaturated.<br>\nBattery- It lasts a day with medium usage a charger in backpack will come in handy if u r a heavy user.But this goes true for every other smartphone now a days as my grand also with heavy usage doesnt last a day. You can root the phone &amp; use custom rom &amp; kernel for better battery service.<br>\nCamera- The camera is great but not better than s4, video quality is good though.<br>\nUI- The UI is just the way google wants you to get it its running android 4.4.2 which is the latest &amp; its butter smooth, you can always customize with custom roms &amp; custom launchers The ui is much better than sammys touch wiz<br>\n<br>\nCons-<br>\n1.Non expanble memory( can be overcome with the use of a pendrive &amp; otg cable for media storage.<br>\n2. Feeble speakers <br>\n3.Non inclusion of ir blaster <br>\n<br>\nDont buy sammy overpriced shit as those are not android phones those are just feature phones with marketing gimmick providing you lots of bloatware junk which you would never use &amp; only slow your mobile with time.<br>\nThe nexus 5 is just the best phone in every aspect so buy it &amp; enjoy android as it was supposed to be by google.                                </span>", "<span class=\"review-text\">\n                                    Its been a month I am using it now. N I've fallen in love with it. The usable internal  memory of 12.5gb is a little less but the performance of the phone is amazing. Its smooth and fast. Superb display. camera and battery backup is ok ok.. <br>\nI got it at a much better price than the market price and thanks to flipkart for that. Its worth every penny.                                </span>", "<span class=\"review-text\">\n                                    Hi,<br>\n<br>\nI brought this phone @ 27k last month from flipkart. Happy with the performance of both flipkart (on entire buying process) as well as phone. Earlier i was using samsung note series but if i compare it with nexus 5, it is no where near the nexus league. This phone doesn't have any lag. Also, i am quite happy with the camera, as i have seen lot of reviews where people have critisized it alot. But it is same as 8m samsung phone. Infact front camera is better, bet on that.<br>\n<br>\nOnly drawback which i found is, its very delicate and it display glass is not as rigid as any other top market player. If it falls from your hand then be ready to shell out another 10k, personnal experience. Also, choose wisely between 16 and 32 GB. As 16 gb limits us on lots of stuff.                                </span>", "<span class=\"review-text\">\n                                    The only problem I faced is battery  it does not last very long and some issues with network some time but barring this two things it is great phone to buy!!!                                </span>", "<span class=\"review-text\">\n                                    This is the best buy in sub INR 30,000 category.Period.<br>\n<br>\nThe whole package - hardware and the software - are tightly knit together. This is Android at it's sublime best. One could be excused from believing that Google Play store was custom built for NEXUS range on the lines of iTunes for Apple products. <br>\n<br>\nIt does all the tasks beautifully which 99% common people like me expect from a smart phone...some useful apps, music, videos. taking pictures, sharing files and stuff like that. The 4.95 inch screen and resolution is  wonderful...it fits nicely into your hand w/o having to do any jugglery act as with large screen phones.<br>\n<br>\nCamera could have been tad bit better (I've been a Nokia user :-)) but apps do make up somewhat for the short-fall.<br>\n<br>\nWith the price having gone down further, this is a wonderful device to have. Unless, you want to wait for NEXUS 6 or whatever Google chooses to call it.                                </span>", "<span class=\"review-text\">\n                                    Even every one agree this Nexus 5 is better than its costly rivals from samsung,LG,Sony .Mainly because of its price point,killer specs with very good build quailty.<br>\nWait until XIOAMI MI3 arrives.MI3 is a heck of a phone with killer specs and build quality with the price for 14k we can buy 2 phones equal to one nexus phone.<br>\nLet us wait and see how Nexus 5 will fare against the Juggernaut in form of MI3.                                 </span>", "<span class=\"review-text\">\n                                    I ordered Nexus 5 just 2 days before leaving for Germany and got it delivered the very next day. Thanks to flipkart's in a day guarantee. <br>\nNow, let's do some talking about the phone. <br>\nThis phone is a beauty in terms of design. The buttons are very well placed and one hand operation is very easy. The 4.97 inch LCD Display is ideal for everyday use. It's neither too small nor too large like the Lg G2. It' just perfect. The viewing angles are great and colours are just perfect. The mat finish at the back gives it a premium look. ( back just loves finger prints, so you'll see the fingerprint marks every now and then. Annoying. )<br>\nTalking about performance, this phone is a monster. 2.2 Ghz snapdragon 800 with pure vanilla android makes this phone flawless. It can handle any game with ease. <br>\nThe only problem is that battery drains fast. So, if you are a heavy user carry the charger along.  <br>\n <br>\nSumming up:<br>\nPROS:<br>\n-Great design<br>\n-Great performance<br>\n-Decent Camera<br>\n<br>\nCONS:<br>\n- Fingermarks catchy back.<br>\n- Average Battery Performance                                </span>", "<span class=\"review-text\">\n                                    The device is just awesome everyone is saying that there are problem with battery and camera. The battery run for about 1 day 3 hours and 23 mins on heavy usage. I have not faced any of the issues with device till now. The people were also saying that they are facing problems after updating to Android 4.4.4 but till now no issues after updating.<br>\n<br>\nHere are the pros and cons of the device.<br>\n<br>\nPros:<br>\n4.95-inch Full HD IPS Display<br>\nQualcomm Snapdragon 800 quad-core processor (the best processor for smartphones)<br>\n2GB RAM <br>\nFast performance<br>\nAndroid 4.4 KitKat upgradable to 4.4.4 (android L will also come first on this device after it officially releases)<br>\nGets Android update first as the device is maid by google<br>\nRich Android experience<br>\nAdreno 330 450MHz GPU for awesome gaming<br>\n8MP rear camera with LED flash (awesome image quality) with new HDR  mode and 1.3MP front camera<br>\nNFC support<br>\n16GB in-built storage (12.98GB user accessible)<br>\nWireless charging<br>\n3G  (4G is also supported in Indian models so do not need to worry. You will be able to use in coming years),<br>\n<br>\nCons:<br>\nNo secondary memory support<br>\nNo FM Radio support<br>\nHave issues with Wi-Fi connectivity but this problems occur sometimes and it is going to be fixes by Google with the upcoming Android update.<br>\n<br>\nI want people who are looking for an awesome smartphone in Rs.28,000 please keep a serious eye on this device as this is the best from Google in this range. I have been using this device from the last one week till now it is working smoother and faster as a new device works. Recommend this device to everyone who are looking for an amazing android experience. Also, the delivery was very faster as in my location in-a-day guarantee is not available but still got it it after 2 days of ordering. Amazing service from Flipkart and Google.                                </span>", "<span class=\"review-text\">\n                                    Flipkart delivery was superb. Using the nexus 5 since 1 month.  Amazing smartphone, no lag at all. Also got kitkat 4.4.3 update. Playing game on this smartphone also smooth. Games like real racing, fifa 14 works smooth not even minor lag. I recommend this smartphone to everyone.                                </span>"]},
{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    The Nexus series of phones by Google have been bashed by the reviewers for one reason or the other. But just let me tell you that Google has made one of the best Nexus phones ever with the Nexus 5. I wouldn't go in length describing each and every feature of the phone as there are already a zillion reviews on the internet. It is definitely the best Nexus phone ever.<br>\n<br>\nJust go for it. You will not be disappointed.                                </span>", "<span class=\"review-text\">\n                                    Hi, i bought this phone from FlipKart on 20th April and this is what i felt in these 3 days of my usage:<br>\n<br>\npros :<br>\n<br>\na). The processor is a beast.Smooth handling without a single lag.<br>\nb). the screen is awesome. you would love to watch movies &amp; pictures in this phone. the 4.95 inch screen full hd screen with 445 ppi is the best you can have.<br>\nc). adreno 330 gpu does amazing work in handling all the graphics<br>\nd) 2 GB Ram.<br>\ne) kitkat gives a wonderful android experience<br>\nf) camera is good , may not be the best in low lighting otherwise good, especially after the update . The HDR+ feature works very nicely.<br>\ng) if you love gaming , then you will love the phone .<br>\nh) reading news &amp; magazines feels great in this phone due to the large screen with high resolution. <br>\ni) it is very light . back panel gives a nice grip.<br>\nj) Design is awesome.<br>\nk)plus its Google's.<br>\n<br>\ncons <br>\n<br>\na) the major con is the battery. it has a battery of 2300 mah , which is not at all good, i have to charge at least twice to perform basic functions, the screen drains a lot of battery.  Nexus 5 has a bug where a demon thread which works for the camera keeps on working even camera is off. Hope it gets resolved in next update.<br>\nb) auto brightness of the phone works too well. it gives you more brightness than required , eventually draining your battery<br>\nc) the speaker sound is very clear but a bit low. could have been better.<br>\n<br>\nBut overall this phone is the best if you compare to other high-end phones.                                </span>", "<span class=\"review-text\">\n                                    it is an awesome phone. it is so beautiful and has a very good battery life.<br>\nit has got amazing photo quality.<br>\nthis phone is just too good.<br>\ni dont regret buying it.                                </span>", "<span class=\"review-text\">\n                                    I just want to take a moment to say that this is by far the best phone made for a price range which is so attractive. It matches with or in-fact it downright beats most of the top notch high end phones  in the market in a  one to one match-up. The only problem I face is with the battery, It could have been better/long lasting.Few minor s/q glitches. Nothing that can't be fixed. Some s/w upgrades in the 4.4.3  will enhance the battery life and the camera focus quality  says Google. Can't wait for it. All in all best phone, best price and on time delivery .                                </span>", "<span class=\"review-text\">\n                                    I picked this phone up after using the Nexus 4 and I have to say the switch has been worth it.<br>\n<br>\nPros:<br>\n<br>\n1. Unlike my Nexus 4 which I needed to charge by 5-6PM after an overnight charge, my Nexus 5 is still at 30% at the end of the day. This is with constant wifi and a few phonecalls, plus bluetooth connectivity with my car's music system. I was pleasantly surprised by this.<br>\n<br>\n2. The screen is a step up too. I don't watch a lot of videos on my phone admittedly, but when I do, it feels a lot better than the Nexus 4.<br>\n<br>\n3. It's faster. Especially with the udpate to KitKat, my Nexus 4 had gotten visibly sluggish at certain points. The Nexus 5 on the other hand is extremely smooth to use and works like a charm.<br>\n<br>\n4. English (India) - I hadn't noticed this before, but there's now an English(India) option for the phone which refreshingly doesn't require me to pronounce the words as carefully as before when using voice search.<br>\n<br>\nCons:<br>\n<br>\n1. The speakers, while a step up from the Nexus 4, are still not great. That said, I don't use the speakers much anyway, so it's not a big deal for me.<br>\n<br>\n2. No micro SD slot. This means you're stuck with the space you have built-in. I just have a handful of songs (mainly for ringtones) as most of my music is on spotify. I haven't run into any issues with space but I can see this being a con for other people.<br>\n<br>\nOn the whole, this is a great phone at a good price. Grab it if you're sticking to android.                                </span>", "<span class=\"review-text\">\n                                    Before buying this phone i read all the reviews.... and many reviews said cons - 1) Battery 2) speaker<br>\n<br>\nBatter backup is decent as in all the smart phones, i never switch off my 3G and does everything but it is far better then NOKIA lumia in all sections. Speaker are good enough (guys it is a phone) speaker are just perfect. Processor is out of the world (class performance). Touch can be compared to that of apple.<br>\n<br>\ndowload radio and file manager when ever you buy.<br>\n<br>\nIn this range we have note2, s4, moto X but Nexus 5 stands tall with KITKAT ! :) Samsung all phone looks almost the same. <br>\n<br>\nGOOGLE ROCKS !                                 </span>", "<span class=\"review-text\">\n                                    A beautifully crafted phone with v.few shortcomings.  The shortcomings are, no memory card, shorter capacity battery and a camera that struggles to focus in varying light condition and no FM radio. If you can forgive these then this is the phone to go as its the only android phone to get the latest updates from google.                                </span>", "<span class=\"review-text\">\n                                    I have had my Nexus 5 for about 2 months now and it has certainly lived upto it's claims with regards to speed and efficiency.<br>\n<br>\nLooks wise, I feel the phone looks best without any cases and pouches because its really sleek.<br>\n<br>\nPerformance wise:<br>\n1. Battery backup is about 12 hours (just as bad as most android phones)<br>\n2. Display is clear and big enough for you to enjoy videos<br>\n3. It will support most of the games you will want to play<br>\n4. Money wise too it is a good choice because it's config is very competitive compared to its modest pricing.<br>\n5. Speakers suck a bit but so much that you'll regretted buying the phone. <br>\n6. Camera is absolutely fine despite the reviews it got when the phone was released. The quality was fixed in an update which you'll get the moment you turn on your new phone.<br>\n7. Heating issue do exist. The phone tends to heat up when you are a playing a game for longer than 5-10 min and also when you are charging the phone.<br>\n<br>\nOverall impression is that its worth it. You'll never feel that you compromised on quality for price (as is the case with the Samsung S Duos which is really just garbage)                                </span>", "<span class=\"review-text\">\n                                    I wanted to buy this phone on Flipkart but the phone was not available online and had to wait for long time before buying it, due to its limited availability in the beginning. But trust me the wait was worth it, coz when I saw this phone for the first time; it was love at first sight. The phone just looks beautiful with its black body finish.  The phone is extremely light weight compared to the bulky and huge phones available in the market nowadays. The best part of the phone is its display and processor. Unlike Samsung, that has a bluish color display, colors on Nexus look very rich and vibrant.  Watching movies and playing games is a treat. The phone has 2.3 GHz Qualcomm Snapdragon 800 Processor which makes the phone a superfast device and it does not lag irrespective the no of application running in background.  The camera of the phone is also awesome and captures beautiful images even in low light. And being a google phone running on the latest android version of kitkat, you will be the first one to get all the recent updates. Had heard some negative reviews about its battery life, but I have personally not faced any issues till now since the last one month of using this phone. In fact after charging my phone completely, the full battery lasts for the entire day with god amount of usage of playing games, listening to music, calls and etc. And not to forget that the battery of the phone gets full charged in an hour! With Samsung and other mobile phone companies launching their phone at 35K to 40K with similar specifications or less, Nexus 5 is worth every penny spent. So don’t hesitate before buying this masterpiece, because you will never be disappointed.                                 </span>", "<span class=\"review-text\">\n                                    Guys I got nexus form Google India playstore. This phone heats up within 10-15 mins if you play even simple games like candy crush or subway surf. To do a simple teset, turn on Wifi and open chrome and browse for 10-15 min and check the back panel. You will feel the heat and this is not expected from a Rs.29,000 phone.<br>\nI called up google and they asked to me return the phone and sent me a replacement. Even the replacement phone has this issue. Check with your friend, play a game, and if you play heavy games then you are dead. It heads up badly. <br>\nRest the phone is good but the heating problem bothers and even my samsung galaxy grand or my lumia 900 is better than Nexus 5. They dont heat up even playing for hours.                                </span>"]},
{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    google is delivering nexus 5 in 1-2 business days and at 1K less to boot. i dont know who would buy from flipkart.<br>\nthough i would like to point out flipkart is a great service n i use it regularly.                                </span>", "<span class=\"review-text\">\n                                    First of all Flipkart guys ....i love you for the awesome return policy , you have always assisted me with every problem , which i why i never buy anything from anywhere else than flipkart   . Thanks a ton   .<br>\n<br>\n Ok now for the review I am reasonably well versed with phone features and i know what i am Writing here .  Lets me get started with cons first <br>\n<br>\nCONS           Front Camera    Pathetic grainy  pics in CFL lighting . <br>\n                       Rear Camera     Very Average , even Samsung core has better <br>\n<br>\n                       GPS cannot find a lock  unless its absolutely clear sky and still loses the fix  time and again  , which is very annoying .    The signal level shown on GPS test apps is pretty saddening . <br>\n<br>\n                        Heating issue  with the phone while surfing and Talking  on Phone . Even 20 minutes and the phone gets noticeably warm , which is pretty bad considering that your battery power is being lost as heat  instead of being utilised to run the operations , Which means really inefficient circuitry   and electronics . <br>\n<br>\n                       Speaker phone   sounds jars at even 75  % volume   like a China Phone  that labourers and construction workers use .  Pathetic . You can make out higher frequencies . <br>\n<br>\n                      Microphone is a very big problem as the person you are talking to can hear a muffled sound with attenuation of higher frequencies .  <br>\n<br>\nAll these problems i have noticed in one day .  I can only imagine whats in store for me ahead . <br>\n<br>\nPros   :                         The Name  is NEXUS 5 <br>\n                                      The Screen is crisp and decent . <br>\n                                      Battery life seems to be ok  <br>\n<br>\nMy Verdict .........Only buy at gunpoint . I am not kidding . I d give this phone a pass . Id rather buy Xiaomi MI3  or Note 2                                </span>", "<span class=\"review-text\">\n                                    No doubt this phone has lucious body, great resolutions and speed but has serious problem with the most basic features. It suffers with horrible microphone quality along with other software glitches. I had such bad experience with this phone that i had to claim refund from flipkart.<br>\n<br>\nIssues: 1. When I picked up any call, caller was not able to hear me for 1st 2-3 seconds.<br>\n2. Sometimes callers were complaining that I sound as I am talking from a long distance. This is an epic problem with Nexus 5. Google a bit to know more.<br>\n3.Record video in a silent place and watch that video to know the hissing sound which goes even worse when records a voice.<br>\n<br>\nThese problems were not there when I used headphones.<br>\n<br>\nOther issue: 1. When i got call waiting and tried to pick up the second call...phone hangs and caller hears continuous ringing. This happens randomly.<br>\n2. During long hour calls..phone heats up and restarts automatically.<br>\n3. Mobile data does not connect unless phone is restarted once. <br>\n<br>\nGoogle has improved some of the bugs with update 4.4.2 but I don't know why they are ignoring microphone issues. If this persists, I am sure success of this phone won't last long.                                </span>", "<span class=\"review-text\">\n                                    I don't know why people cannot wait for some more time- lot of options available<br>\n<br>\nXiomi MI4 , One+One , Nexux 6 , Moto X1... Are upcoming smart phones which are best value for money after september 2014.<br>\n<br>\nNexus 5 Pricing is bit high- Price should have been 20K.<br>\n<br>\nAnd also people are running behind MI3 where Mi4 is already released in China!!<br>\nMI3 is not the Best. <br>\n<br>\nUPDATED <br>\nNOTE: ALL THE EXISTING PHONES WILL BE OUTDATED IN ANOTHER 6 MONTHS AND NEW TREND OF 64 BIT PROCESSOR &amp; ANDROID L WILL START.                                 </span>", "<span class=\"review-text\">\n                                    Why Flipkart shows MircoSD cards in supported acessories with Nexus 5 , and in combo offer Samsung MicroSD card . Why would anybody want a MIcroSD card when Nexus does not support MIrcoSD.                                </span>", "<span class=\"review-text\">\n                                    I got Nexus 5 the beast at price 1K less without taxes and/delivery charges from Play Store within 48hrs of placing the order.                                </span>", "<span class=\"review-text\">\n                                    Nexus 5 is a true Beast which offers a very clean and high-performance android 4.4 experience. Having said that this is the first device to be running android 4.4, I must add that this is not only the first but also the best device you will get for a price range of 30k running Android Kitkat. The Hardware delivers smooth performance not just on Reviews, or Hands-Ons but in real time as well. This is a definitely thumbs up phone to go for.                                </span>", "<span class=\"review-text\">\n                                    I orderd the phone from Flipkart, I came to know that the phone is malfunctioning like:<br>\n<br>\n1. Hangouts SMS's are not getting updated immidietly, sometimes SMS sent are not at all displayed in hangouts.<br>\n2. While you are on call suddenly microphone stopped working, the next person on call unable to here you.<br>\n3. Camera stopped working at any point of time with error.<br>\n4. Hangs a lot many times.<br>\n<br>\nWhen I raised a complaint for returning it, the request got rejected saying \"seller rejected the request\".<br>\n<br>\nFeeling like cheated :(                                </span>", "<span class=\"review-text\">\n                                    1.  No LED indicator for low battery, SMS/mail/missed call, even while charging.<br>\n2.  There are some complaints that the phone speaker doesnt work properly when you are in sleeping position or in a rocking chair but I did not face this problem too many times.<br>\n<br>\nOverall, it is a good purchase.<br>\n<br>\nHowever, I have a very bad experience with Flipkart!<br>\n<br>\nThe day I purchased the product, it was 29182.  Within 2 days, the price fell to 27182.  When I spoke to customer care, they said that they have a policy that refunds the difference amount in the form of a promotion code within 3days.  I had to call the customer care multiple times to check the status of my request.  Every time they said, their sales team is working and confirmed that I will be getting the promotion code very soon.  However, after around 7days or so, I got a mail saying that I am not eligible for promotion code.  Thank you flipkart.  When I started thinking to depend on you for my shopping activities, you rightly gave me a signal not to trust you!  I appreciate it!  COMPLETELY!                                </span>", "<span class=\"review-text\">\n                                    You know the specs. I don't think i need to say anything about that. I'll say a bit about the practicality. <br>\n<br>\nLooks : Plainly and comfortably built. Both black and white looks good if that's your cup of tea. But for a person who likes adding some color, it could be a bit dull, especially those pink-loving girlfriends we all have. :D The 4.95 inch full HD screen is gorgeous, and with 445 ppi, its a beautiful way to watch a movie on a flight or a metro ride. Keep in mind that, although good, its not the best out there, Iphone5s and htcOne can still make it look cheap comparitively, but thats also a small difference.<br>\n<br>\nH/W : Camera: For an 8mp its pretty decent a shooter. Though perfect pictures in dim light situations and/or with moving targets are still a distant dream, and comparing with a Lumia1020s 41MP or again the Iphone5s can really really make it look bad. But it does the job well for most of us. And polishing the camera apps and some tuning around could make it better in future android releases. But atm, its just okay.  <br>\n<br>\nPowered with a 2.26 Ghz Snapdragon 800, nexus 5 practically flies. No hitches anywhere unless u were benchmarking. And touch response is also pretty fast though there are a couple of phones that come to mind which can do better, though not significant enough to cause concern or to mention here.  4.4 Kitkat has more polishing to be done, and seeing that google might already be on it, no cause to worry there either. And seeing its a nexus, this one will get to try it the earliest. <br>\nThe graphics performance is also great owing to the adreno330GPU and the 2gigs of RAM. All the best titles on android run without much stutter or dropped frames, though thats not from me, just the word on the street.<br>\n<br>\nOne worrying thing is, battery life is not great. One day is maximum it can manage with moderate use. Seeing with a bigger screen size than the n4 it was to be expected, it is still not a good thing to know. Might need to keep the charger close in most days of constant heavy use. <br>\n<br>\nAltogether, its the best android experience so far seeing its the cleanest stock android4.4 phone that will be available, in addition to the impressive specs and performance. But if you don't care much for the android, and only want the best phone around, this is not it. Its great, unbelievably good for its price, but unbelievably good ONLY for its price, not the best. If it was upto me, id get it no questions asked, but some of us who want a bit more, like the best phone in the market right now, or the phone with the best cam or the best looking phone, this is not it. Its the best optimal package of all that into the most competitive price. Its a 5/5 coz of the price, but keeping the price apart, just phone wise, id give it a 4/5. But that IS pretty good. There are only one, or maybe 2 phones better in the world atm. And they all cost hell of a lot more.                                 </span>"]},
{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    Buy it from Google play store @ 28999 and Google provides a replacement in case device gives any problem. Retailers sell at 1K extra and they offer a repair warranty. Buying it from Flipkart sellers also the same repair warranty and replacement.<br>\n<br>\nNexus 5 is too good as a device. Some patches though will increase the battery life.                                </span>", "<span class=\"review-text\">\n                                    One of the best devices in range 25-35k....if u are planning to go with it then simply go with it...its awesome....superb..                                </span>", "<span class=\"review-text\">\n                                    Already spoken about everything in the title...using a nexus 5 32 gb white phone for past couple of days....phone function is butter smooth and weight is so good that my hands feel happy when they work on it...i'm using a protection flip cover on it like on all my other phones and really like the built of it as still others might be complaining about. <br>\nWithout using extra vocabulary i'd like to say that i highly recommend this phone over any current phones...tried xperia z and note 3...liked neither and now in love with nexus. with a moderate to high use...this phone gives me around 6 hours of backup...but i'm nt complaining. Will use a portable charger if need be.<br>\nThis phone does not heat at all like others i've used so far with similar processor and ram.<br>\nWay to go baby...;)                                </span>", "<span class=\"review-text\">\n                                    Great phone at a very good price. Worthy of being called a true flagship, since it includes all high end specs and a full HD screen. <br>\nTwo major concerns however, are, the battery life because of the not so big 2300 mah battery and the Camera which is not at par with the other 8 mp cameras (Reviewers say google will fix it in a software update) Can't complain much because of the price tag.<br>\nOther than that, its a great buy! And people stop bitching about the high price, its only asking for 2k more, because its available here before the official launch! We all know for how much an iPhone sells in India before its official launch! (P.S. Not an iPhone hater, an iPhone user myself, will be using android side by side) :)<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Placed the order for Nexus 5 as it was cheaper on Google Playstore. Expecting the instrument to be delivered in the next 3 days. Will post a review after using the product for 15 days. <br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Do not buy nexus 5 only because it's economic. Reason being the LCD screen which is very fragile. Drop it from two feet, like it would slip out of your trouser pocket while you're seated, and the screen shatters. The Gorilla glass and screen is fused together, so the whole component gets replaced, which costs around $150(Rs.6800 in India). Add that to the price and Nexus 5 isn't value for money anymore. <br>\nThe LG customer care employees are well aware of this defect. I only mentioned to them that the screen of my phone is broken, and they guessed my model correctly.<br>\nI sold mine just after having it for 3 months. My heart broke to sell it off because it was one hell of a machine, but I knew that it could drop gain. Check the internet for the issue yourself if you don't believe me.<br>\nI am giving it a single star just to make people aware of what they are getting into.                                </span>", "<span class=\"review-text\">\n                                    It is too much cost compared to \"Xiaomi Mi3\" and Xiaomi Mi3 futures also rich than<br>\n Google Nexus 5.<br>\n<br>\nPros: <br>\n<br>\n1. OS:Android v4.4 (KitKat)<br>\n2. Corning Gorilla Glass 3<br>\n<br>\nCon: compared to other mobiles (Xiaomi Mi3)<br>\n<br>\n1. Primary camara only 8 MP only<br>\n2. Secondary camara only 1.3 Mp only<br>\n3. Low power Battery 2300 mAh<br>\n4. Single Flash only<br>\n5. Cost is 100 % higher<br>\n<br>\nConclusion: I selected The same configuration, better futures phone with 14k \"Xiaomi Mi3\" on this Online MegaStore.<br>\n<br>\nThis is Srinivasa Murthy Gullapalli<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Its too bad that most of our population does not even know about the Nexus series. Middle-class ignorants think Samsung is the best. Upper-class ignorants think that Apple is the best. Sure Nexus phones aren't the cheapest or look the most premium, but when it comes to performance, NOTHING even comes close to them. And they have very reasonable price since Google does not intend to earn much profit from them. And they are easily and infinitely customizable. Nexus 5 is definitely the best smartphone in the world right now when you take into account every factor (though Moto X and LG G2 aren't much behind).<br>\nSo forget about your Sammys and Apples. Give Nexus 5 a try and you will never look back.                                </span>", "<span class=\"review-text\">\n                                    this is an truly amazing device. This seller must have worked hard to get these devices as soon as they released because they were sold out within 33 mins of launch time on the google play store in us. There are so many people who can give even more than 40k just to have this device but they cant because its sold out already(having waiting time of over 2 weeks) <br>\nConsidering this, you should feel blessed that someone is offering this device to you at reasonable rates. It is faster than the NOTE3 which is priced north of 50k. The processor in this device is the fastest mobile processor. Plus you get a good 8mp BSI camera which is also optically stabilized. Key feature is the Android Kitkat 4.4 it is shipped with. <br>\nI highly recommend it.                                </span>", "<span class=\"review-text\">\n                                    with the price of new iphones ever increasing and going out of reach, an iphone fanatic has nothing else to do than buy an android phone with great specs and low cost.<br>\n<br>\nThings i like ;<br>\n - price, price, price<br>\n - perfect size. 5\" is jus a perfect size. not too big like HTC 816 and not too small like moto g<br>\n - full hd display is just beautiful. i do not wanna use my non-retina ipad mini for reading anymore, text and videos are just the best they can be,<br>\n - looks just fantastic. feels fantastic, and catches everyone's eye. <br>\n - even when its priced so competitively, you dont see it in everyone's hands like the moto g. So thats a big plus that this phone is still exclusive and I am not lost in the crowd. (one of the reason i no more like my iphone 4S, everyone has one now :P )<br>\n - latest android os is a big plus plus<br>\n - touch screen without the screen gaurd is like the best screen i've used in this price range.<br>\n<br>\nfor the cost the phone is absolute rockstar and the main attaraction is the full hd display, sleek design and always the latest android.<br>\n<br>\nthere are a few things that blew me off like :<br>\n - the edges on top of phone are a little sharp n not too comfy,<br>\n - battery life is only 1 day with extensive / average use, which is almost like any other smart phone,<br>\n - calls do tend to fade off in the beginning or in between as the front speaker is a bit small n takes time to get used to.<br>\n - the glass support is toooo thin and i broke the phone's screen in the 2nd month of purchase and costed me like 8k to replace it,<br>\n - the android doesnt support lock screen notifications like ios does, n the support apps tend make the android a little bugged / laggy... <br>\n - doesnt have the moto x lockscreen / standby features such as notification display on standby etc. <br>\n - last but not the least, its not ios<br>\n<br>\nstill i am giving 4 stars as the likes outway the dislikes, given the current price. If you are looking to buy this phone now, then i would suggest to wait till they launch nexus 6 and the price of nexus 5 goes down even further. <br>\n<br>\nat this price, there is no other better phone. just go for it.                                </span>"]},
{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    This is a great phone. But its aging now (only specs wise, not performance wise). Very recently better choices have emerged in market. Moto X (2014) is in one way the new Nexus, (untill Google officially announces Nexus 6). Consider Moto, else Nexus 5 definitely.                                </span>", "<span class=\"review-text\">\n                                    overall good service... with packaging tracking and quality... good product....<br>\nm happy with the product<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I owned it from another Online Site. Some good things to share about this --- The ''BackPanel'' is so Serene to Touch &amp; then the ''GoogleNow'' is quite SWIFT - TY.                                </span>", "<span class=\"review-text\">\n                                    It's been more than a month now, and Nexus 5 has made my life seem way too easy; what with it's unbeatable and too good to be true smooth processor, i can switch between apps and browse the net from any screen in a jiffy.<br>\n<br>\nAnd since I do alot of gaming on the phone, the battery life seems to ooze out in no time, that is just the one thing i would term as it's shortcoming.<br>\nSo, apart from the battery draining problem (but then again, which remarkable smartphone doesn't have a \"battery draining problem\"? ) I would definitely give the phone a 5 on 5.<br>\n<br>\nAlso, i got an amazing window of  opportunity to buy the phone for 26k on flipkart so I immediately went ahead and ordered it without a second thought.  <br>\nAll in all, it's an amazing buy and absolutely worth it's pricing.<br>\n<br>\nFlipkart Service was as usual great. Had asked for in-a-day delivery (as i couldn't wait) and got it on time.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    nexus is the best android if you really want to enjoy android just go for it ,...<br>\nawsm phone no leg... and the display quality is so gud .. :)                                </span>", "<span class=\"review-text\">\n                                    Screen viewing angels are awesome, Good camera, Good battery life, no lag in any app, call quality is good and looks great even when screen is on standby.<br>\n<br>\nOnly one issue ( Big ), I am not able to connect mobile with my windows xp pc..I have to transfer files using pendrive.                                </span>", "<span class=\"review-text\">\n                                    after only days of purchase, the display has started malfunctioning. request for replacement is not being paid any attention to.                                </span>", "<span class=\"review-text\">\n                                    Awesome performance with the Snapdragon 800 Processor. This phone never lags!.<br>\nSeamless performance and with a simple UI of Vanilla Android from Google.<br>\nBest part about Nexus is all the bug fixes come for this phone and will be receiving Android L soon! Even specific update of Android 4.4.4 R2 (Release 2) was given to some countries including India for connectivity issue with some mobile internet service providers.<br>\n<br>\nAbout Flipkart's delivery, it was on time and the packaging was good and shock proof.                                </span>", "<span class=\"review-text\">\n                                    <br>\nIncredible &amp; awesome shopping experience from flipkart , ordered at 2000hrs and there it was waiting for me before I reach office by 1000. <br>\n<br>\nLooks stunner , amazing performance , super cool build for rest of the spec's check google :) Love the mobile.<br>\n<br>\nGoogle is the best.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I  have no complaints after more than a month's use of this marvellous thing. However the battery as with all Nexus is rather shoddy. If you have a late night planned, make sure you have it charged through the day or the phone will die on u.                                </span>"]},
{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    After lot drama I buy this product. With thanks to flipkart. Initially I buy Moto X after my friends good review. but my luck was not that good. I got defected piece twice even after replacement.Then I requested to money back and flipkart returned then I go far this lovely mobile.<br>\n<br>\nThere is no doubt in performance of this mobile its very fast.it always shows 1.2 GB free RAM  will all your basic application running. so you can play heavy games. <br>\n<br>\nDesign is good. there is feel good factor when you hold in hand. <br>\n<br>\nAndroid is nice OS.  I recommend buyer if you buy this product. always send feedback to google for your new requirement. of course nexus user will be first user of next new release of android.<br>\n<br>\nCamera : It is good not exceptional but you can enjoy your photos on lappy and mobile. If you want to see your photo on big size TV then you may feel some issue in photo quality.<br>\n<br>\nStill camera has good feature like photo spare is very good.<br>\n<br>\nOk Google : It is very good even better then moto x. You can call message etc using this app.<br>\n<br>\nHeating : Approx No, Mild heat when you play game long time or download heavy data form wifi. Doesn't effect performance. Less heating problem in compression to moto x.<br>\n<br>\nCall Quality: As I have read many issue with microphone while call. I haven't see any issue while call. <br>\n<br>\nBattery: Its depend on your use. At max One day. if you click 70 photos in a day it will run only for 10 hr. Just watch you battery usages. <br>\n<br>\nIf you are using camera/vedio recording you should keep your charger in your bag. <br>\n<br>\nElse it is fine. 24 hr with <br>\n<br>\n2. hr screen <br>\n1 hr call voice<br>\n1/2 hr game play ( basic games)<br>\n14 hr wifi on. <br>\n<br>\nBattery has little less power  but you can handle it. <br>\n<br>\nI gave 5 rating without considering battery of this phone. with battery performance 4.5. it is.                                 </span>", "<span class=\"review-text\">\n                                    Unboxed , switch it on , holy crap is that some kind of joke this shit is running faster then my computer DAMN!!!<br>\nsmooth layouts, optimized device, eye catchy as hell<br>\nenough for you to fall in love with it                                 </span>", "<span class=\"review-text\">\n                                    You cannot have a better performing fone at this price. Fast! Damn Fast ! Faster than my 4GB laptop !<br>\n<br>\nI was sick of Android, but nexus 5 got my faith back!!                                 </span>", "<span class=\"review-text\">\n                                    I think its one of the best smart phones at the price at which its available, the processor 2.3 quad core really makes huge difference and with 2GB ram its running like a full fledged machine. The display is amazing with crystal clear images. The best part is that you get immediate updates and if you have a good wifi connection then you will have great fun downloading apps within seconds.                                </span>", "<span class=\"review-text\">\n                                    I had sony xperia, then I got Samsung S2 later samsung S3. When lost S3 I got a nokia 520. Fifteen days later I bought Google nexus 5. With this back ground I feel this phone is not the worth money it is being sold for. <br>\ni may not write details, It is slow compared to S2 or S3. Lot of easy features which we routinely use are missing. Steps are little longer. <br>\nIt should have been in a below twenty category. S3 beats easily. <br>\n<br>\nNow yesterday it just slipped from my hand and screen shattered. <br>\nGoogled and found it is a common problem. Right now it is difficult to replace. There is an online petition going on to recall this. So far 256 members have signed. Worldwide so many have found the screen to be very fragile which breaks with minor fall. <br>\n<br>\nCheck there is online petition for recall in . Change. Org.                                 </span>", "<span class=\"review-text\">\n                                     - the phone,even though it says is push, it works primarily on pull  I rarely get alerts for my whatsapp and emails unless i visit those applications<br>\n- network is a major issue - lacks clarity while talking plus there is constant clicking noise while on the call. It is annoying<br>\n - it heats up quite a lot even despite the fact that i do not have any other application beside whatsapp and the ones which came pre-loaded<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Having problem with both Phone &amp; 3G.  First cannot able to hear the voice properly...  Same goes with the Caller as well.  They are not able to hear my voice properly.<br>\n<br>\nThen comes 3G... couldnt get the connection properly.  While the same is used in another phone, it works.<br>\n<br>\nWhat should i do now.  This new phone has become new pain.                                </span>", "<span class=\"review-text\">\n                                    I am a basically Samsung android user, I attracted towards the stock android by seeing the stunning specification of this phone. I bought nexus 5 through Flipkart, good packing good delivery timing. After getting into stock android, I slowly started realizing the bitter truths which are hidden behind the cutting edge hardware specification. Let me list out the points directly by not discussing its specification, because you can get tons of sites which are displaying specification. I wonder, I did lot of research before buying this phone, but I never came across the following points during my research, this is the review of the phone after the usage of nearly one month.<br>\n <br>\n1) Since it does not have in-built file manager, you need to download one file manager after immediately switching on the phone in order to access the memory for the files like .pdf .xls .doc .apk etc. There are no such user friendly file manager in play store, you need to compromise with one, I did the same with OI file manager<br>\n<br>\n2) It has blue tooth connectivity, but you cant send any file through blue tooth. To do this you need to install third party app, This might be because of lack of inbuilt file manger,  remember the receiver should also have same app in order to receive the file. But you can easily receive the files without any problem<br>\n<br>\n3) It has wifi direct facility, but you cant use it. To use this you need to install third party app and (same blue tooth problem) receiver should also have same app.<br>\n<br>\n4) Every one complains about battery life, I got decent one day battery life after a moderate usage (Internet connection is 2G, not hardcore game lover)<br>\n<br>\n5) The main part is Mobile network connectivity problem, automatically network goes off and never returns back. To regain the network connectivity every time you need to search the network in settings menu, I did all circus, I gone through all settings to over come this problem, but problem still remains same. Many users have this problem after up-gradation to Kitkat,  I wonder why Google guys are neglecting this problem since the launch of kitkat. I used to miss lot of company calls and personal calls if I fail to check the network connectivity in phone regularly. Day by day it is getting worse, and I am planning to return the phone since it has one month returnable warranty.<br>\n<br>\n6) Many users also reported wifi connectivity problem, I have not faced such problems so far.<br>\n<br>\n7) Camera does its work better in daylight but lags in night time<br>\n<br>\n8) It has multi color notification LED, through which you can easily recognize the phone message, watsapp message,missed calls and so on with out swiping up the display. But some times it malfunctions by blinking without any notification <br>\n<br>\n9) All hardwares are of cutting edge technology and having stunning specification, the good part is that phone never hangs, this is because of high frequency CPU, 2 GB RAM, Absence of Blotware, Light weight of stock android. At the same time stock android sucks in many aspects. <br>\n<br>\nFinally a good hardwared phone with lot of software bugs, think twice before going to this. It seems Google is not going to address all this bugs in near future. Beware of your hard earned money.<br>\nI am returning the phone                                </span>", "<span class=\"review-text\">\n                                    Yes this phones doesn't come with ear phones. I guess its not costlier on Flipkart because the price given on play store is EXCLUDING TAX. In the US the phone cost 399$, thats the price on play store. But at payment it shows around 440$. So I don't think flipkart has over priced it, though I feel google has over priced it ;)<br>\nAtleast with that pricetag I would have liked a set of earphones as well. But having said that, the specifications are wonderful.                                  </span>", "<span class=\"review-text\">\n                                    I purchased this phone just because of pure Android and of course mighty hardware.<br>\n<br>\nIndeed this phone is a monster specwise but the culprit for me is that crap, called pure Android,  sucked the life out of me. Full-fledged piece of sh*t, bugs in everything made the pure Android experience a living hell.<br>\n<br>\nWell done LG, but screw you google, AOSP, OHA or any dumb individual involved in development of Android 4.4.2.<br>\n<br>\nP.S.<br>\nIf you consider to buy this phone and change the rom or wait for update then here is a news that there is absolutely no stable rom for this phone(no CWM, MIUI) and next android is no way near.<br>\n<br>\nThink before you purchase this in essence of pure android.Samsung , Sony, HTC are not fools for not providing pure android.                                </span>"]}]