[[[[{"link": ["/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/google-nexus-5/product-reviews/ITMDZKKQHQXYC64R?pid=MOBDQ9VXXXX6NF8V&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    google is delivering nexus 5 in 1-2 business days and at 1K less to boot. i dont know who would buy from flipkart.<br>\nthough i would like to point out flipkart is a great service n i use it regularly.                                </span>", "<span class=\"review-text\">\n                                    First of all Flipkart guys ....i love you for the awesome return policy , you have always assisted me with every problem , which i why i never buy anything from anywhere else than flipkart   . Thanks a ton   .<br>\n<br>\n Ok now for the review I am reasonably well versed with phone features and i know what i am Writing here .  Lets me get started with cons first <br>\n<br>\nCONS           Front Camera    Pathetic grainy  pics in CFL lighting . <br>\n                       Rear Camera     Very Average , even Samsung core has better <br>\n<br>\n                       GPS cannot find a lock  unless its absolutely clear sky and still loses the fix  time and again  , which is very annoying .    The signal level shown on GPS test apps is pretty saddening . <br>\n<br>\n                        Heating issue  with the phone while surfing and Talking  on Phone . Even 20 minutes and the phone gets noticeably warm , which is pretty bad considering that your battery power is being lost as heat  instead of being utilised to run the operations , Which means really inefficient circuitry   and electronics . <br>\n<br>\n                       Speaker phone   sounds jars at even 75  % volume   like a China Phone  that labourers and construction workers use .  Pathetic . You can make out higher frequencies . <br>\n<br>\n                      Microphone is a very big problem as the person you are talking to can hear a muffled sound with attenuation of higher frequencies .  <br>\n<br>\nAll these problems i have noticed in one day .  I can only imagine whats in store for me ahead . <br>\n<br>\nPros   :                         The Name  is NEXUS 5 <br>\n                                      The Screen is crisp and decent . <br>\n                                      Battery life seems to be ok  <br>\n<br>\nMy Verdict .........Only buy at gunpoint . I am not kidding . I d give this phone a pass . Id rather buy Xiaomi MI3  or Note 2                                </span>", "<span class=\"review-text\">\n                                    No doubt this phone has lucious body, great resolutions and speed but has serious problem with the most basic features. It suffers with horrible microphone quality along with other software glitches. I had such bad experience with this phone that i had to claim refund from flipkart.<br>\n<br>\nIssues: 1. When I picked up any call, caller was not able to hear me for 1st 2-3 seconds.<br>\n2. Sometimes callers were complaining that I sound as I am talking from a long distance. This is an epic problem with Nexus 5. Google a bit to know more.<br>\n3.Record video in a silent place and watch that video to know the hissing sound which goes even worse when records a voice.<br>\n<br>\nThese problems were not there when I used headphones.<br>\n<br>\nOther issue: 1. When i got call waiting and tried to pick up the second call...phone hangs and caller hears continuous ringing. This happens randomly.<br>\n2. During long hour calls..phone heats up and restarts automatically.<br>\n3. Mobile data does not connect unless phone is restarted once. <br>\n<br>\nGoogle has improved some of the bugs with update 4.4.2 but I don't know why they are ignoring microphone issues. If this persists, I am sure success of this phone won't last long.                                </span>", "<span class=\"review-text\">\n                                    I don't know why people cannot wait for some more time- lot of options available<br>\n<br>\nXiomi MI4 , One+One , Nexux 6 , Moto X1... Are upcoming smart phones which are best value for money after september 2014.<br>\n<br>\nNexus 5 Pricing is bit high- Price should have been 20K.<br>\n<br>\nAnd also people are running behind MI3 where Mi4 is already released in China!!<br>\nMI3 is not the Best. <br>\n<br>\nUPDATED <br>\nNOTE: ALL THE EXISTING PHONES WILL BE OUTDATED IN ANOTHER 6 MONTHS AND NEW TREND OF 64 BIT PROCESSOR &amp; ANDROID L WILL START.                                 </span>", "<span class=\"review-text\">\n                                    Why Flipkart shows MircoSD cards in supported acessories with Nexus 5 , and in combo offer Samsung MicroSD card . Why would anybody want a MIcroSD card when Nexus does not support MIrcoSD.                                </span>", "<span class=\"review-text\">\n                                    I got Nexus 5 the beast at price 1K less without taxes and/delivery charges from Play Store within 48hrs of placing the order.                                </span>", "<span class=\"review-text\">\n                                    Nexus 5 is a true Beast which offers a very clean and high-performance android 4.4 experience. Having said that this is the first device to be running android 4.4, I must add that this is not only the first but also the best device you will get for a price range of 30k running Android Kitkat. The Hardware delivers smooth performance not just on Reviews, or Hands-Ons but in real time as well. This is a definitely thumbs up phone to go for.                                </span>", "<span class=\"review-text\">\n                                    I orderd the phone from Flipkart, I came to know that the phone is malfunctioning like:<br>\n<br>\n1. Hangouts SMS's are not getting updated immidietly, sometimes SMS sent are not at all displayed in hangouts.<br>\n2. While you are on call suddenly microphone stopped working, the next person on call unable to here you.<br>\n3. Camera stopped working at any point of time with error.<br>\n4. Hangs a lot many times.<br>\n<br>\nWhen I raised a complaint for returning it, the request got rejected saying \"seller rejected the request\".<br>\n<br>\nFeeling like cheated :(                                </span>", "<span class=\"review-text\">\n                                    1.  No LED indicator for low battery, SMS/mail/missed call, even while charging.<br>\n2.  There are some complaints that the phone speaker doesnt work properly when you are in sleeping position or in a rocking chair but I did not face this problem too many times.<br>\n<br>\nOverall, it is a good purchase.<br>\n<br>\nHowever, I have a very bad experience with Flipkart!<br>\n<br>\nThe day I purchased the product, it was 29182.  Within 2 days, the price fell to 27182.  When I spoke to customer care, they said that they have a policy that refunds the difference amount in the form of a promotion code within 3days.  I had to call the customer care multiple times to check the status of my request.  Every time they said, their sales team is working and confirmed that I will be getting the promotion code very soon.  However, after around 7days or so, I got a mail saying that I am not eligible for promotion code.  Thank you flipkart.  When I started thinking to depend on you for my shopping activities, you rightly gave me a signal not to trust you!  I appreciate it!  COMPLETELY!                                </span>", "<span class=\"review-text\">\n                                    You know the specs. I don't think i need to say anything about that. I'll say a bit about the practicality. <br>\n<br>\nLooks : Plainly and comfortably built. Both black and white looks good if that's your cup of tea. But for a person who likes adding some color, it could be a bit dull, especially those pink-loving girlfriends we all have. :D The 4.95 inch full HD screen is gorgeous, and with 445 ppi, its a beautiful way to watch a movie on a flight or a metro ride. Keep in mind that, although good, its not the best out there, Iphone5s and htcOne can still make it look cheap comparitively, but thats also a small difference.<br>\n<br>\nH/W : Camera: For an 8mp its pretty decent a shooter. Though perfect pictures in dim light situations and/or with moving targets are still a distant dream, and comparing with a Lumia1020s 41MP or again the Iphone5s can really really make it look bad. But it does the job well for most of us. And polishing the camera apps and some tuning around could make it better in future android releases. But atm, its just okay.  <br>\n<br>\nPowered with a 2.26 Ghz Snapdragon 800, nexus 5 practically flies. No hitches anywhere unless u were benchmarking. And touch response is also pretty fast though there are a couple of phones that come to mind which can do better, though not significant enough to cause concern or to mention here.  4.4 Kitkat has more polishing to be done, and seeing that google might already be on it, no cause to worry there either. And seeing its a nexus, this one will get to try it the earliest. <br>\nThe graphics performance is also great owing to the adreno330GPU and the 2gigs of RAM. All the best titles on android run without much stutter or dropped frames, though thats not from me, just the word on the street.<br>\n<br>\nOne worrying thing is, battery life is not great. One day is maximum it can manage with moderate use. Seeing with a bigger screen size than the n4 it was to be expected, it is still not a good thing to know. Might need to keep the charger close in most days of constant heavy use. <br>\n<br>\nAltogether, its the best android experience so far seeing its the cleanest stock android4.4 phone that will be available, in addition to the impressive specs and performance. But if you don't care much for the android, and only want the best phone around, this is not it. Its great, unbelievably good for its price, but unbelievably good ONLY for its price, not the best. If it was upto me, id get it no questions asked, but some of us who want a bit more, like the best phone in the market right now, or the phone with the best cam or the best looking phone, this is not it. Its the best optimal package of all that into the most competitive price. Its a 5/5 coz of the price, but keeping the price apart, just phone wise, id give it a 4/5. But that IS pretty good. There are only one, or maybe 2 phones better in the world atm. And they all cost hell of a lot more.                                 </span>"]}]