[{"date": ["<div class=\"date line fk-font-small\">\n                                01 Feb 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                12 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                08 Jan 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                09 Apr 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                13 Jul 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                01 Mar 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                15 Jun 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                25 Jan 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                07 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                06 Aug 2014                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Living Up The Hype                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                i would prefer not to buy apple products through online                             </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Going for Samsung...missing the ultimate experience                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Buying guide by an user.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                The name is enough apple ipad mini                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Available in the same price range without exchange                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Best tablet ever                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Quality tablet at price not so high                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                FINALLY                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                A huge disappointment                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    Been using the iPad mini for now 1 month...i'm quite sure this is the time i should review it .<br>\n<br>\nScreen:<br>\nHave used my bro Samsung Galaxy Tab 2 , my iPad mini does look a lot bigger in dimensions &amp; screen size ...its color reproduction is also very good.....(vibrant) &amp; the auto brightness just works fine.....!!<br>\n<br>\nProcessor:<br>\nalthough it has A5 chip which is similar to iPhone 4s , i never kinda found any lag while using it....i have played heavy duty games on it (NFS most wanted,Real Racing2hd , Real Racing 3,Modern Combat 4,Real Steel,Asphalt 7,GTA 3,Mass Effect Infiltrator,Lili , Sky Gamblers-Air Supremacy , Shadow Gun,Contra Killer &amp; many more Graphics intensive games...!! <br>\n<br>\nRam:<br>\nyep it has 512 MB ram that's kinda  low compared to the android devices but guess what it ain't running android its iOS which is kinda less ram hungry &amp; virtual ram usage is @peak ... so let me summon up to u ...if u open 50 apps on your iPad still there wont be any lag...coz of virtual Ram ....&amp; also when device is cold booted (Started) there is about 250mb Ram free (depending upon the services u keep &amp; notifications &amp; apps on the springboard..)<br>\n<br>\nDesign:<br>\nFrom day one there wasn't a day that i didn't admire the apple's build quality...&amp; pretty good ergonomics ...fits perfectly in my hand ..little bit slippery but still good<br>\n<br>\nCamera:<br>\nYou don't wanna miss these camera quality ,it is on par with my nikon Point &amp; shoot camera 10 MB of course Megapixels don't matter , the lens matters &amp; guess what it has the same lens which is in iPhone 5 which is best renowned for its superb pictures by far...&amp; this device performs perfectly in Macro (Small Less distance) Photography... Secondary Camera is also good its HD ... &amp; video chatting works just fine...&amp; video quality on primary is also good 1080p<br>\n<br>\nConnectors:<br>\nday one i m happy with its lightning connecter ,its so small &amp; irreversible....<br>\n<br>\nSpeakers :<br>\nStereo sound is also reproduced @ every instance mostly in Hip -Hop &amp; R&amp;B songs<br>\n<br>\nO.S:<br>\nthere is the plethora of apps for the iPad mini..... its the apple eco-system....95% apps run fined on my iPad mini ...*&amp; I'm not gonna lie some notorious apps crashed &amp; that was just once in a week like something...<br>\n<br>\nBattery:<br>\nit has got 4500mAh + battery ... apple claims 10 hours on WiFi <br>\nmy statistics <br>\nvideo -8.3hours full HD<br>\naudio - never mind it goes on &amp; on <br>\nWiFi browsing 9.7 hours <br>\neBook reading :16 hours <br>\nstandby : 1month (Apple claims)<br>\ndaily normal usage it last for around 1.5 day.<br>\nheavy gaming :6-8 hours (NFS , Shadow Gun etc)<br>\nit takes 2 hours to charge my iPad with standard charger<br>\n<br>\nStorage:<br>\nyou only get 13.7 GB of storage space...that's is perfect coz bits &amp; bytes calculations <br>\n&amp; i gotta tell you if u have more money opt for 32GB coz i have 16GB &amp; its not enough 160 apps (12 GB )installed right now no movies no songs 10 eBooks &amp; some office files <br>\nso most space is taken by the apps <br>\n<br>\nSensors: <br>\njust play some sensor games for eg. Temple run 2 it works perfectly with my accelerometer ...<br>\n&amp; 3 -axis gyro sensor for all directions tilt (360 degree panoroma)<br>\nmagnetometer for compass (digital compass) really helpful in astromony &amp; navigation<br>\nambient light sensor - for auto brightness<br>\n<br>\nMy Recommended Apps:<br>\naNote HD<br>\niBooks<br>\n+Downloader<br>\nGoogle Earth<br>\ndjay<br>\nFlipBoard<br>\n360<br>\nDMD<br>\niFileExplorer<br>\nSystem Status<br>\nTouch Calc<br>\nCompass HD<br>\nPaper<br>\nEvernote<br>\niWork<br>\niLife<br>\nmobisystems-CollinsEnglishDictAndThes<br>\n1Password<br>\nnight sky<br>\nAdobe ps Touch<br>\nDocuments to Go<br>\nHD QuickOffice<br>\noverall i m in love with this gizmo ...if you want some great apps list by me do email me ...<br>\n<br>\nkautilyasave@gmail.com<br>\nor Google Plus Me (Kautilya Save)<br>\nor Facebook Me   (Kautilya Save)<br>\n<br>\nP.S i haven't used any scratch guard for it ,coz search Youtube its scratch proof &amp; i have bought 1 accessory from BELK (Rs 550/-)- its duplicate smart cover (APPLE SMART COVER wasn't available in my area @ that instance)<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I didn't knew that I would suffer this much<br>\nIts been more than a month since I got iPad mini. I had planned of many things of doing with an iPad mini. But I never expected to keep it with the service center for more than a month !!<br>\n<br>\nThe display had an issue since the very beginning. It was extremely yellowish in color. This problem was starkly evident on white background. This really ruined the apple experience for me.<br>\n<br>\nWhat is more heartening is that my friends who also got iPad mini at the same time, didn't had any problem like this. When I talked to apple customer care they gave me funny reasons like for India apple is providing yellow display. <br>\n<br>\nWhen I told them I checked with friends and other store I didn't find any yellow display they first decline to acknowledge that it is a problem. But when I send photos as a proof that the displays in other stores are fine, they said that its in the specification of apple to have both yellowish and normal display and I have to accept the display as is.<br>\n<br>\nI told them if this is the case then confirm it in mail that its apple specifications to have yellow display they declined to do so.<br>\n<br>\nNOW I ADVICE YOU TO NEVER BUY AN APPLE PRODUCT ONLINE AS ITS A PURE GAMBLE WHAT YOU WOULD GET. <br>\n<br>\nONCE YOU HAVE IT THEY ARE NOT EVEN ACKNOWLEDGING IT IS A PROBLEM. WHILE YOUR FRIENDS ENJOY APPLE EXPERIENCE, YOU WOULD BE STUCK UP WITH A YELLOW DISPLAY THAT WOULD RUIN AN APPLE EXPERIENCE FOR YOU<br>\n<br>\nI hope Flikpkart would take notice and help me out in this case as I have given up hopes on apple customer care                                </span>", "<span class=\"review-text\">\n                                    The title is a little confusing but this is I want to say that if you are going for samsung then you are certainly going to miss the ultimate apple experience.<br>\n<br>\nUnlike it's competitors when apple launches something for a cheaper price, it still makes sure that the quality is not compromised.<br>\n<br>\nI hope you will benefit from this tab as much as I did. <br>\n<br>\nPros:<br>\nDisplay<br>\nSpeed<br>\nWi Fi connectivity<br>\nBattery life<br>\nPretty Handy<br>\n<br>\nCons:<br>\nNone till now for me                                </span>", "<span class=\"review-text\">\n                                    Hello all, let me share with you people my experience using an ipad mini with some ratings. I had a Spice stellar before and have also tried Ipad 2,3 and 4. all below mentioned ratings are for the ipad mini with 10 being the maximum:<br>\n<br>\nDisplay 8.5 : having used a spice stellar pad before, the display is very good, may not be as good as ipad 4 though.<br>\n<br>\nDesign  9 : It makes the ipad 4 look massive and outdated in the design department, seriously, why the original ipad design in the latest ipad? The build quality and looks are simply amazing! always go for a black, because white borders are too distracting, on the other hand, black borders seems to blend with the display. <br>\n<br>\nGaming 8 : the gaming experience is very good, the graphics is superb, it can easily handle nova 3, but, you might feel the need for a little more real estate. But, no way it is congested, very comfortable to hold for long hours.<br>\n<br>\nOS 7.5 : iOS 6 is one of the most criticised mobile OS and I agree with it. ..having used android 4.2 I can clearly notice the lack of options to customise. Ex: no widgets, no custom keyboard, no file manager, the iOS 6 is not really bad, the experience is still very good, the 5 finger pinch app exit feature is superb! The user interface is silk smooth, and you can feel the richness of the jitter free interface.<br>\n<br>\nBrowsing 6 : this is a bit of a disappointment, the biggest culprit here is flash, it simply ruins your browsing experience. It is also very hard to read in the portrait mode, as you have to double tap every time you open a web page. What is the point in going for a large display when you have to double tap every time?<br>\n<br>\nMovie experience 4 : simply too small to watch movies, the display quality may be good, you can almost forget watching movies on this.<br>\n<br>\nBattery 9 : continuous gaming the battery lasts for upto 6.5 hours. a bit of gaming and browsing continuously it lasts for upto 8 hrs! <br>\n<br>\nMultitasking 10 : I run several apps together and it does not lag one bit. I can safely say that iOS 512MB RAM = Android 1GB RAM all apple softwares are so well written unlike android and windows, there are practically no bloatwares.<br>\n<br>\nI would try to answer some of the questions springing in the minds of a prospective customer:<br>\n<br>\nWifi or cellular? <br>\nWifi! I wirelessly tether from my android phone and the speed is very good! I have gps in my android phone, so I do not need it either.<br>\n<br>\nBlack or white?<br>\nBlack! as mentioned before, white borders are too distracting, it makes your display look smaller, but the back silver panel on the white is incredibly sexy!<br>\n<br>\nIpad mini or ipad 2/3/4?<br>\nIpad mini! The ipad 2/3 and 4 are too big, the weird 4:3 aspect ratio, very difficult to carry around. Those thick bazels! the original ipad design even now in the ipad 4 th generation? What is apple thinking? Ipad 2 display is very bad, ipad 3 hardware not good enough to handle retina display, that is why ipad for was quickly released within a span of 6 months.<br>\n<br>\n16GB or 32GB?<br>\n16GB is good enough for apps and games. I do not store music and videos in my ipad mini.<br>\n<br>\nI still give the ipad mini a 4 star rating for the sheer pleasure of possesing an apple product, the promising iOS7 update in the future, some complete and solid  fix for flash in the near future. ..come on what are your options? Samsung is selling overpriced garbage, Nexus 7 display is too small and 10 is overpriced. The reliabilty of Indian and chinese tablets are questionable, I returned my spice stellar within 1 month of purchase. Amazon kindle 8 inch and 9 inch are yet to be released in India, at the momment I think ipad mini is the best your money can buy:) use it now and resell later in future if you find a better product, apple products have a good resale value:)<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Hey friends, here i want to share somethings about apple product. apple product is known for it's brilliant build quality and simplicity. i have faith in apple products that's why i ordered not 1 but 3 ipad minis for me and my family. many people talking about ipad that it has only 512MB of RAM and 1GHZ dual core processor but the thing is they don't know that apple uses different Operating system called iOS which don't need quadcore or octacore processor for faster, smooth performance and apple maid more than 3 lakh apps designed only for ipad. these apps are specially made for ipad screen resolution and u will not notice any type of lag while using it otherwise apps will only stretched like we seen in all other android tablet.                                </span>", "<span class=\"review-text\">\n                                    I was initially impressed with flipkart on seeing this offer, i became curious and planned to buy..But looks like this model is available on other sites at approx. same price...then why do i have to give my old smartphone, laptop or tab in exchange...Flipkart seems no long pocket friendly...                                </span>", "<span class=\"review-text\">\n                                    Pros:<br>\n<br>\n. Awesome performance. Like a silk touch. I have 2 other tablets but nothing matches iOS.<br>\n. Great looking, sturdy and sleek built. <br>\n. Quality of iApps. <br>\n. Amazing flipcart delivery. Delivered in 2 days.<br>\n. Even though resolution is less, color saturation is very good. <br>\n. Gives same fluidity and performance after 1 year. Most androids becomes very slow and buggy over the period even with 1 gig RAM and processors. <br>\n<br>\nUltimately, you ll have own an iPad in order to 'feel' it.<br>\n<br>\nCons:<br>\n<br>\n. Average audio/video quality. Doesn't support all formats. <br>\n. Battery life with WiFi on. But even all other tabs suffers from this.<br>\n. iTunes. Sucky software. You can't use it a storage device.<br>\n. No Email saving. Pricey office suite application.<br>\n. Price. Should be around 17K. That's what it cost in US<br>\n<br>\nAll in all, I spend more time in apps and using outlook and surfing for which, it's great. I don't  listen songs and clicking pictures so I am okay with average feature. <br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I bought Ipad mini yesterday after lot of deliberation. I was really disappointed by the price of Nexus 7 in India, it is double of what they are selling in US. While Ipad mini is Rs. 3.5k to 4k more in Indian market. <br>\n<br>\nSpecs wise even though Nexus 7 is better on paper, the screen quality, display and user experience of Ipad Mini is unbeatable. I was looking for a tablet with good display especially for reading books, surfing net. Ipad Mini fits the bill. <br>\n<br>\nIf you are more into playing games I would recommend Nexus 7. It has got 1 GB RAM, quad core Tegra processor which is ideal for games. And if you are some one who wants every possible feature into a single tablet and not very particular with quality go for Samsung Tab 2.<br>\n<br>\nCons of Ipad Mini:<br>\n<br>\n. The only serious one I have seen in Ipad Mini is lack of retina display, you will observe this more in images with lot of details. The zoom quality is not that good, the pixels are coarse &amp; grainy, it is good otherwise and much better than other tablets.<br>\n<br>\n. Got only wi-fi, you need to pay 8k more for cellular. For people who wanna use while travelling I would suggest buy only wifi Ipad model &amp; purchase a cheap portable battery operated modem, which supports 2g,3g,4g, all in one.<br>\n<br>\n. A 16GB Ipad mini gives only 13 GB space for usage and it is not extendable. This is a serious problem for people who store lot of songs &amp; videos. A 32 GB version costs 6k more. But you can always take the backup in PC or on iCloud. Even Nexus 7 is not extendable but you can use USB on the go cable to connect extenal Hard discs which is not possible for Ipad mini.<br>\n<br>\nIt is out of stock in FlipKart for many days other wise I would have bought it here. Even in Imagine store it was out of stock which clearly shows its high demand.                                 </span>", "<span class=\"review-text\">\n                                    After waiting for more than a month,apple releases the much awaited apple ipad mini<br>\nspecifications<br>\n<br>\npros<br>\n1)handy size-7.9 inches<br>\n2)5Mp isight camera-visually stunning<br>\n3)1.2 Mp front camera<br>\n3)extremely light weight<br>\n4)full aluminium body<br>\n5) 1GHz dual core processor,this works like a charm<br>\n6)light on your pocket for the features<br>\n<br>\ncons<br>\n1) resolution-not expected from apple<br>\n<br>\nthats it...but the resolution is not such a downer<br>\nand please,now that the mini is out,DONT THINK ABOUT SAMSUNG OR GOOGLE,<br>\n<br>\nthe tablet doesnt exactly come in one hand..but its still a handy size..the resolution is more than enough...all games run smoothly as expected and the camer is awesome..build quality is mind blowing...<br>\nenjoy<br>\ncheers<br>\nkeshav                                </span>", "<span class=\"review-text\">\n                                    Apple iPad mini is a huge disappointment. It's an inferior product with many compatibility issues. I switched from an android tab to apple one hoping for better performance but I was in for a shock for so many reasons.<br>\n<br>\n1, iPad doesnt support immensely popular app like whatsapp<br>\n2. Half the times when you are trying to download apps you get an error \"This app cannot be downloaded at this time\" and if you google for this error, you will get many people who are facing this issue.<br>\n3. This iPad hangs whenever I use Gmail<br>\n4. iPad doesnt support immensely popular app like instagram<br>\n5. I am a freelancer and use apps from freelance websites regularly like eLance and oDesk. Surprisingly neither eLance nor oDesk is available for iPad.<br>\n6. There is no way to hide personal apps on iPad which can be done so smoothly on an android tab.<br>\n7. They do not provide a hands-free (ear phone) with iPad mini<br>\n8. Every time you install an app you have to enter your apple password. This is extremely annoying.<br>\n9. I started facing issues with this tab right from second day of purchase. The seller WS Retail disaaprove my request for replacement. I would not recommend iPad as well as W S Reatil to anybody. (I had been buying from W S retial for so long and I am a flipkart first member, still I have to face this issue. Terribly disappointed)                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                21 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                20 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                20 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                07 Mar 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                09 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                31 Jan 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                25 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                10 May 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                16 Mar 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                07 Dec 2012                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                It's an iPad. Enough said.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                A piece of beauty!!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                My first apple product.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                It holds it's ground                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                There is unique feature in apple.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                so bad tablet ever made by apple                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Buy it Blindly. The Name is Enough!!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                The best Tablet ever                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Nice &amp; worth priced product...!!!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Not the best                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    Nothing beats an iPad at-<br>\n<br>\n-Touch sensitivity<br>\n-Audio Quality<br>\n-Screen Quality<br>\n-Ease of use<br>\n-Availability of Apps<br>\n-Battery life<br>\n<br>\nBought this for my Dad (57) and he figured it out in just 2 days.<br>\nI use it to read books.<br>\nAbsolute delight.<br>\nWorth every penny.<br>\nIt's an iPad. You can't go wrong with an Apple product.                                </span>", "<span class=\"review-text\">\n                                    This being my first Apple device, I was curious to see how it turns out. After using the tablet for a lil over 3 months now, I am so glad I opted to try out an Apple device. <br>\n<br>\nApple stands a class apart in terms of both the product quality and the apps that are built for it. Rarely experienced any hiccups while using the tablet. I did feel a lil awkward with the fact that you cant access the storage for transferring any files and the fact that the files are closely tied with the apps that you use for you to upload them onto the device. <br>\n<br>\nBut that said, the device doesn't feel cheap or compromised and one can surely give this a try if they're new to Apple and are in a dilemma whether to go for this one over an Android tablet. One would surely love the quality of Apple.                                </span>", "<span class=\"review-text\">\n                                    It never lags, has tons of applications and customization. I just might buy an iPhone soon thanks to this tablet. After experiencing iOS7, I'm ditching Android and joining the Apple fan boy club.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Ok now I will be very honest in my review. I have been a android lover for the past many years. I hated apple because of its limitations. In December I bought the google nexus from Flipkart and enjoyed the experience just for two months after which it started hanging and just wudnt  boot up. I lost all my trust on android. <br>\nThe iPad is in a league of its own. Forget ram or ghz it doesn't matter wth this beauty. Everything is super smooth and made for the iPad unlike android tablets where the apps r common with mobile phones. The entire experience of using this tab is mind blowing. And now even more value because of some apps r available free like keynote, numbers, iPhoto garage band. This is a tab that u can use for work or play. Yes it's expensive but use the exchange offer to its fullest. That's what I have done ! If you have the money for the retina go for it otherwise the mini is just fine as it is. This will definitely change the way you do things and wil make stuff all the easier and fun. The apps are actually made for the iPad mini. It's got a mix for everyone. Hope you enjoy the iPad just like how I'm enjoying every bit of it. Thx Flipkart for making this exchange possible and getting this product to me on time.                                </span>", "<span class=\"review-text\">\n                                    Hi frds,<br>\n<br>\n i bought ipad2 an year ago after they slashed 100$ when next model was launch. to accept indian using only upto 60% of the any product they buy.<br>\n<br>\nprice wise apple is more than other tab. i was satisfied with ipad 2 features expect camera quality , and after using long days i felt some thing smaller would be better , i was waiting for this ipad mini from the rumors started.<br>\n<br>\nThis product as grt features and touch and stability.<br>\n<br>\nipad uses:<br>\n1) Have collection of photos of fav ones.<br>\n2)  Browsing, read news through apps.<br>\n3) check mail often or FB and chat , skype and video chat is best.<br>\n4) some time music and videos - for HD <br>\n5) keep some fav movie <br>\n6) small games for family kids rarely.<br>\n<br>\nThere is one option i dont knw whether apple users found , in setting - &gt; some text speech option is there , On that first , than while browsing some article u select para than it will show copy,paste,speech . if u click speech it will read the article like news reader , in setting choose lang and speed levels.<br>\n<br>\nif people dont connect with internet expect inside home ,they can go for wifi models.<br>\nfor this purpose people can go for ipad.                                </span>", "<span class=\"review-text\">\n                                    i buy this tablet and i saw that it does not support some apps but those are running my brothers samsung tab 2.it  has started hanging in few days and the its wifi gets damaged. i complaint to apple service centre but they said that we konw that your tab has gets damaged under inyhe warranty but we have not responsible for inner harm of apple i pad mini because it was the cheapest tab yet developed by apple. but samsung tab 2 is more better than ipad mini.it also has call facility. please dont buy this tab                                </span>", "<span class=\"review-text\">\n                                    why to by other tab when at this price we get apple ipad Mini.<br>\nUsing it from 1 month and no problems received till now. i use it 5-6 hrs a day. install apps.. Can u image that i have installed 103+ apps and still the tab works without even hanging... far better than android which cannot even run 1 big game like fifa 14 or asphault 8 airborne properly.. but ipad does everything without any problem.. dont think that i have used this for a month only and this review is made without experience.. i am a tech geek and would advice u to buy it blindly. there are many rumours that u cannot tranfer photos videos music from apple to non apple pc.. u can do it by downloading itunes on ur pc/laptop..go for it.. ios7 preintalled.. if not then u can just update it..but be BEWARE of 1 thing U must have a good net connection (not 2g) or a wifi to enjoy full use of ipad as most of the features require internet.. but thats not a big issue/problem..                                </span>", "<span class=\"review-text\">\n                                    I got my ipad mini way back in November 2012 wen it had just launched in India,as a die hard android geek I never wanted to shift over to apple,but I took the risk n instead of the nexus 7 tab I got the ipad mini..<br>\n<br>\nTotal VFM..iOS on the ipad mini is so buttery smooth that my htc one x feels like a punctured race car.<br>\n<br>\nipad mini tablet apps quality is far more superior n better optimized as compared to the ones on google play store.<br>\n<br>\nAlso there are tons of ways to get free n paid apps on the ipad without even jail breaking.<br>\n<br>\nThe 5mp camera produces real vibrant colours n the HD VIDEO RECORDING is smooth as silk.<br>\n<br>\nSo if ur planing to buy a budget tablet,then look no further as the ipad mini will be all u need,n pls avoid android tablets coz they lack build quality n app quality...plus ipad mini has tons of accessories.<br>\n<br>\nAlso I get over 20 hrs of continuous use on a single charge with wifi on..so battery life is awesome...                                </span>", "<span class=\"review-text\">\n                                    At 22k budget,this is the best tablet in the market...if you're a game lover...just go for it...looks &amp; touch interfaces are great..but I think apple iOS is a little bit difficult for android users &amp; new gadget users..no data transfer is possible without iTunes..this problem must be solved..processor is very fast..although it has 512 mb of ram.it has 16 GB of internal memory,but 13.7 GB is usable.which is problematic for movie lovers...bt in overall no other tab is comparable to this product..in this budget..camera is not so good.bt it has 5 mp primary &amp;1.2 mp secondary camera...at last in my opinion..it is the best worth priced tab in market..go for it...&amp; also thank u FLIPKART ...for its surfer fast delivery...thanks...:)                                </span>", "<span class=\"review-text\">\n                                    Cons:<br>\n<br>\n1. A5 dual core 1GHZ processor[Where is A6?] - less than nexus 7 quad core 1.2GHZ tegra 3 which is CHEAPER than this.<br>\n2. 512MB RAM- again :(<br>\n3. IOS - Limitations [eventhough IOS s great it has many limitations.]<br>\n4. pixel density - 162ppi. [Wake up APPLE, where is RETINA?].<br>\n5. Sources says that Ipad Mini 2 s going to be released on the start of 2013[With RETINA DISPLAY]. Beware..<br>\n<br>\nPros:<br>\n<br>\n1. IOS optimization. You will not feel any lag even-though it has only 512MB RAM.<br>\n2. ease of use.<br>\n3. Stunning design [Apple is always good in this.]<br>\n4. GPU is also good[PowerVR]<br>\n<br>\nconclusion: GOOD PRODUCT AVERAGE [BAD for me] SPECS.<br>\n<br>\n                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                17 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                10 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                09 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                12 Aug 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                26 Mar 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                29 Sep 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                27 Sep 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                25 Sep 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                25 Sep 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                23 Sep 2014                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Wifi issues                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                don't go for nexus 7 go for it                             </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Ipad mini VS Nexus 7                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Over-hyped product                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Nice Deal . Useless Product                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                too greattt!!!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Apple Products bring Happiness                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Great ipad                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Ipad mini much better than Nexus 7                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Apple is always great                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    Don't ever buy this product. This thing doesn't detect wifi at distances. U have keep it as close to the router. What the heck!.                                </span>", "<span class=\"review-text\">\n                                    guys don't buy nexus 7 ...asus and google are trying to exploit indians by doubling the price .....the ipad mini has much faster gpu and more great apps.....i don't recommend any body to buy nexus 7 ...at first i felt nexus 7 was good .if you watch any comparison video between nexus 7 and ipad mini you can find that the only edge nexus 7 got is with its price and (processor)..the speed of processor doesn't matter much in our every day use ...ipad got way better graphics and it will suite you best if you love gaming on your tablets . in india price of both is almost same so definitly go for ipad mini                                 </span>", "<span class=\"review-text\">\n                                    I dont know how many of u have actully used these devices, or just yapping after reading reviews or reading their specs.<br>\n<br>\nI have used the both i have an mini &amp; my bro has a nexus, if u just compare the specs any kid will say that nexus will win, but there is a catch, on using both i found mini is faster in terms of applications &amp; media, i dont exactly know why, is there really a powerfull processor inside nexus or its just lies, because the A5X beats it hands down, HOW THE HELL CAN A DUAL CORE BEAT A QUAD CORE ?!!!!<br>\n<br>\nGo for nexus only if u dont have enough cash.                                </span>", "<span class=\"review-text\">\n                                    I am using this product for over two months now. Practically useless except for browsing. That too can be frustrating as part of the screen is not sensitive to touch. Obviously you can pluck apples! (only)<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I don't know why people buy this device . Got 7000/- rs off :) .and still i don't have any idea what i should do with this                                </span>", "<span class=\"review-text\">\n                                    packing was very great<br>\nmy ipad wasn't actived yet <br>\nit work as smooth as buter<br>\nreally satisfy with the product and flipkart delivery<br>\nI would highly recomment for this product. Just go for it !!!                                </span>", "<span class=\"review-text\">\n                                    Well, I can talk about the class of Apple products and I'm a huge fanboy. But, I ordered this for my mom as a late birthday gift. And just seeing her unpack the product and so effortlessly use it out of the box speaks volumes for the product. she thought Siri was someone we were on an international call with and was totally flabbergasted when I told her it was AI. And now, she's completely ignoring me for the rest of the day coz she is preoccupied. Thanks Apple. And thanks Flipkart for making the entire booking and delivery process a dream.                                 </span>", "<span class=\"review-text\">\n                                    I got it today and it's awesome and now i writing through my iPad thanks flipkart for this great device                                </span>", "<span class=\"review-text\">\n                                    Ipad  mini is more impressive and more beautiful, but actual comfort lies in the eye of the beholder.<br>\nHigh graphics games run smoothly.<br>\nIt is overall a good buy.<br>\n<br>\nFlipkart delivered the product within two days in standard delivery. \\m/                                </span>", "<span class=\"review-text\">\n                                    Though the service was slow (may be I live in a very tribal area :P)<br>\n<br>\nThe the product seems satisfactory from WS Retail as always.<br>\n<br>\nSmooth and what an amazing touch and its not expensive as well.<br>\n<br>\n                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                15 Sep 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                17 Jul 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                13 Jul 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                06 Jul 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                06 Apr 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                06 Oct 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                29 May 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                07 Jul 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                02 May 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                08 Sep 2014                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Don't buy any it.After 2-3 months it's not functioning properly                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                I-Pad Mini                             </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Amazing product from Apple Inc.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Pathetic                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                The Apple Experience                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Its Fantastic and Marvellous!!!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                iPad Mini                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Superbbb                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Why it's great and comparison with the Nexus 7                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Excellent offer                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    Hi All,<br>\n<br>\nBe careful...!!!<br>\n<br>\nFlipkart delivery service is good.But don't purchase the item from flipkart.After 2-3 months it's not functioning properly,i went to apple authorized service center they said that this is not genuine piece.<br>\n<br>\nI think purchasing electronic items from online stores is not good option.<br>\n<br>\nThanks,<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Very much satisfied with the performance. Lovely touch and beautiful display.. The best thing is that my mom loves it... :) :)                                 </span>", "<span class=\"review-text\">\n                                    Fantastic...Excellent...Marvelous...<br>\n<br>\nI bought this product through Flipkart...as usual the dedication they show towards delivering the products is IMPRESSIVE...<br>\n<br>\ncoming to the performance of this product... well...I am sure that almost everyone is aware of these masterpiece devices offered by the Apple Inc.<br>\n<br>\nPROS: -<br>\n-  Stunningly Good Battery Life...it takes 4hrs 25 minutes to charge completely from 0% to 100%...and you might wonder...the battery back up is about 15-18hrs...(a minimum of 12hrs if you're playing high-end games like Frontline Commandos)<br>\n<br>\n- I got this device with iOS 7.1 (although it was mentioned here as iOS 6)<br>\n<br>\n- the gaming graphics is great...although this device comes with 512 MB the processor is so powerful that you'll be amazed by its speed...<br>\n<br>\n- Perfect to read books...<br>\n<br>\n- Ultra thin Aluminium body which is very lite in weight...<br>\n<br>\n- Xcellent 5 Mega-Pixel Camera with HD Video Recording...<br>\n<br>\nCONS:-<br>\n<br>\n- Users might obviously face certain &amp; very minor difficulties after upgrading the device to iOS 8 which would arrive in this October...<br>\n<br>\nif you want to keep yourself updated and if you're ready to spend a few more bucks then I would recommend you to take Apple iPad Mini with Retina Display (Since it is the latest version of Mini currently available)<br>\n<br>\nbut trust with...this is equally excellent there is no doubt in that...I am using this right now as I am typing this...:P ;)  you'll be happy with this...I am sure you would fall in love with this product...<br>\n<br>\nThank You...                                </span>", "<span class=\"review-text\">\n                                    One the name of innovation, pay for everything..for apps, music, content<br>\n<br>\nDe daata ke naam, tujhki allah rakkhhe ;(                                </span>", "<span class=\"review-text\">\n                                    Apple products are probably meant for those who just want their product to work, the way it has been conceived to work, and for those absolutely unperturbed by the overwhelming restrictions imposed by the OS. There is no doubt it is a great product, especially if one has not had the android experience. It is great for reading pdf files, browsing the web, and so on. Battery life is amazing, especially on standby. There is no microsd expansion slot. If you are used to a file system. as in Windows desktop PCs and in Android Phones, you won't find one here. And a file goes in either through a trusted computer or through the net, and is basically transferred to the care of a specific application.  Bluetooth is rudimentary, and is meant only to connect headphones and stuff, and the concept of wifi-direct is non existent. There is no smooth way to transfer files from your android smartphone to the ipad, except by using cloud based software. If you must, buy it for its sheer beauty, and snob value. But if the ability to tweak and modify, and flexibility are desired, go for a high end android tablet.                                </span>", "<span class=\"review-text\">\n                                    Ipad mini is simply amazing and if you are planning to buy a tablet, better go for it. <br>\nI have been using ipod touch 4th for quite sometime and now i got the ipad mini thru flipkart.<br>\nUsually developers say, android tablets may be customized and apple ecosystem does not allow you to do, but the android customization will be done only after rooting the phone to get access to the kernel....(which voids the warranty)...So no regrets to buy ipad mini.....<br>\nAssuming if you have only 10% of battery left in your phone or tablet, how long it will take to charge again? hardly 20 minutes. But Ipad Mini works for more than 2 hours to charge again.. its still runs today (almost 7 months later). Really a good device.<br>\n<br>\nPros:<br>\n1. Better Battery, lasting for 10 hours<br>\n2. Good resolution<br>\n3. With 512MB RAM, its rocking like anything (i have opened almost 40 applications and still the game Subway Surfer works without any lag)<br>\n4. There are huge number of apps in the Apple store dedicated for ipad (also you can download the apps that were developed for iphone too).<br>\n5. good response time in the touch.<br>\n6. internet is fast as it uses 802.11b/g/n....<br>\n7. ios7 ecosystem, extremely superb.....<br>\n<br>\nCons:<br>\n1. Retina screen is absent (But that doesn't make any difference)<br>\n2. No ear pods<br>\nSo if you are thinking to procure a tablet with a budget of 20k, better try ipad mini. <br>\n<br>\nFlipkart delivered the ipad mini in just one day (chennai)                                </span>", "<span class=\"review-text\">\n                                    Bought 16 GB ipad mini . Its our first purchase of Apple product. Its  very very nice product. Value for money with elegant looks . Proud owner of an apple .<br>\n<br>\nFlipkart has delivered the same within 24 hours of order. Great....                                </span>", "<span class=\"review-text\">\n                                    Verbery good one<br>\n<br>\nVery good one.........i only recommend apple products to buy...because its good and highly sensitive better than other ol tabs....<br>\nSuper battery pack up<br>\n.....;....<br>\nAnd the main thing is by sme apps we can directly add videos songs without i tunes....                                </span>", "<span class=\"review-text\">\n                                    1. Screen: Larger screen and better aspect ratio(4:3 vs 16:9 on the Nuxus 7) allows for better internet surfing, better games, more comfortable keypad to type on.<br>\n<br>\n2. Apps: The iPad has over 250,000 specially made for the iPad and all of the iPhone apps work as well. Nexus 7 has just 100 or so apps and others look ugly on it's 7\" screen(because they are just stretched out phone apps).<br>\n<br>\n3. Ease of use: It's much more simple to use and has many productivity applications that can allow you to do some serious work as opposed to the Nexus 7 which is just a 'showy' device because of it's lack of apps.<br>\n<br>\n4. The cameras are much better, it's ergonomics and slim profile make it easier to use and hold in one hand(keep in mind this is almost 8 inches) which truly allows you to use the device to it's full potential.<br>\n<br>\n5. Longer battery life and more security for your credit card payments and every single app is better on the iPad than on Android(see the Gmail app on both tablets if you don't believe me)<br>\n<br>\n6. Better audio quality and metal construction vs plastic on the Nexus and not at all slow even while playing games like Vice City.<br>\n<br>\nCONS:<br>\n    The screen ratio will make movies shrink a bit and you have to convert every movie into .mp4 format but that's it.<br>\n<br>\nBottom line:<br>\n<br>\nBuy the Nexus if you like to tweak around with your device and like to be geeky all the time. For everyone else, the iPad is the tablet of choice. It's a brilliant experience that only Apple can offer.<br>\n<br>\nTIP: if you can, wait till the end of the year and buy the iPad mini 2 which will include a retina display as well.                                </span>", "<span class=\"review-text\">\n                                    I bought iPad by exchanging my Nexus tab. Overall ipad mini is awesome. But you need to pay for each and every apps. if you have been using Android earlier you may not like ipad. But when you start using you would like. Games- you can filter by free app and download those.                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                28 Aug 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                30 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                18 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                13 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                04 Apr 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                23 Mar 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                22 Feb 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                22 Feb 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                30 Oct 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                24 Oct 2013                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                GOOD BUY                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Good Buy.A great tablet experience.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Excellent                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Good Product at reasonable price                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Flipkart delivery time is BAD.. really BAD                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                applie ipad mini                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                The Best                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Apple forever                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                A little overprized but worth it                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Like Like and Like                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    ipad was quite amazing and it got all in it <br>\nthumbs up for this<br>\nvery smooth and silky touch<br>\nas usual FLIPKART delivered it amazingly quick                                </span>", "<span class=\"review-text\">\n                                    My first Apple product and I am enjoying it a lot.<br>\n<br>\n- Wonderful design and unmatched build quality.<br>\n- Loads of apps specifically developed for Ipads.<br>\n- Excellent Battery life, can go on for hours. <br>\n- Storage capacity (13.4 GB ) is a little less, but is manageable.<br>\n- Screen is awesome even though it is not a retina display. ( If you are willing to pay, then the Ipad mini 2 with retina display is certainly the better choice with its A7 chip).<br>\n- Can play games like Real Racing 3, MetalStorm without any lag.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Product is very good .. and also the offer :D <br>\n<br>\nOld galaxy SII 9k + 1k for using Flipkart mobile apps <br>\n<br>\nand also ipad mini case free :D<br>\n<br>\nthumbs up to flipkart :D <br>\n<br>\nnow am a happy panda :D                                </span>", "<span class=\"review-text\">\n                                    First of all, Thanks to Flipkart for delivering the product on the next day.Delivery was good.<br>\n<br>\nNow the product. The product is <br>\n<br>\n1. Light in weight<br>\n2.Has the perfect form factor. <br>\n3. No lags found so far<br>\n4. Need to clear memory by killing tasks running on background.<br>\n5. Build Quality is impeccable<br>\n6. Display is crisp and the best I have ever seem<br>\n<br>\nI did not find any cons as of now. I will keep the post updated with any negatives if I come accross.                                </span>", "<span class=\"review-text\">\n                                    Its been 5 days since I placed the order and this product hasn't yet received at the nearest hub. terrible delay in delivery and I've no reasons to buy future products from Flipkart                                </span>", "<span class=\"review-text\">\n                                    little disappointed with features..and use of it..<br>\nonly wireless is another disadvantafe og it..<br>\n<br>\nnot able to use much                                </span>", "<span class=\"review-text\">\n                                    Before I start, I would like to identify myself as an Android Fanboy. That being said, this is my first iDevice(unless you consider iPod Shuffle as one, in which case, this is my second).<br>\n<br>\nTo put it simply, mind = blown when I started using this today. The feel of the iPad, the OS, everything exudes excellence and perfection. And to think that this only has the half the power of a Nexus 7(2012) on the paper, yet performs loads better than that, is really impressive. I exchanged my Nexus 7(2012) for this and it's a great deal IMHO.                                </span>", "<span class=\"review-text\">\n                                    There s clearly no comparison  of iOS with open source OS s. Honestly speaking this apple device is really wonderful  every aspect of the build is so clean and perfect that it feels even the very website I open is also built to fit the screen. The size is decent and easily fits in one  hand. Easily sync device across wifi with multiple apple devices or with PC. Siri is not just accurate and intelligent but also witty. <br>\n<br>\nNo hesitation in providing features to the device the OS updates, apps support etc.<br>\nBattery almost lasts for 5 days at the rate 2 -3 hr usage per day. <br>\nA lot of features others are yet to imagine or probably implement in their next release. <br>\n<br>\nNothing to lose in the non retina model except a slight reduced sharpness which results in lack of sharp defined edges of text, graphic. <br>\nA7 chip might not be a big loss for regular usage conditions like reading, browsing. <br>\n<br>\nFeatures:<br>\nNo ads on apps, no fat and cheap plastic body, no malware, spyware etc plaguing in App Store or device, no app killers, boosters, Horlicks etc <br>\nNo false promises on free services.No 1000 google apps pre installed and gulping half memory. None forcing you to sign in/up for specific account. No hangs leading to brutally crack back cover and popping battery. No stretched apps from phone all apps are built again for iPad taking advantage of big screen. Direct device replacement on finding an acceptable defect in product. The built quality is superior and metallic. Even a ₹5000 apple book case is worth to protect this precious product.  Now don't tell me I ll get a tablet for ₹5000 go get an apple iPad .......                                </span>", "<span class=\"review-text\">\n                                    if ur looking for class, buy apple<br>\nor else if ur looking for features go for other tablets<br>\ncoz the ipad cannot do half of the things the other tablets can<br>\nbut then its apple and its got the standard                                </span>", "<span class=\"review-text\">\n                                    Do not buy any other tablet wait and buy this.<br>\nThis mini is too good handy and awesome performance :)<br>\n<br>\nApple tusi great ho !!!!                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                20 Oct 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                19 Oct 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                13 Aug 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                20 May 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                09 May 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                08 Jan 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                07 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                14 Aug 2013                            </div>", "<div class=\"date line fk-font-small\">\n                                10 Dec 2012                            </div>", "<div class=\"date line fk-font-small\">\n                                08 Dec 2012                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Apple products best of all in class n performance!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                You won't get disappointed                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Best in the Market                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Perfection..almost!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                iPad mini simply worth and the best                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Best product you can buy for 22K                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                MINI vs Others                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Most handy successor of ipad family                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Choice is yours...                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Can't beat Apple products: here is why                            </strong>\n                            </div>"], "linknext": "spider:51683c8:flip", "desc": ["<span class=\"review-text\">\n                                    My iPad mini is my 1st Apple gadget I'm using and is 8months old from now and I'm with the new iOS 7 and 71 apps installed in it including high end games like Asphalt 8 Airborne, Fifa '14, Infinity blade 2, Real Racing 3 and other games like dead trigger, temple run, subway etc etc. and as a musician, I use apps like Garageband, Traktor Dj, Cubasis on my iPad itself.<br>\nWell I won't go for the specs anymore. I'm pretty focused on the performance after updating my iPad to iOS7. Well many complained of slowing down, but mine didn't. Some minor hiccups though, but unnoticeable. And I shouldn't complain about this as I love my iPad for playing games and I leave my apps opened in background throughout the day and close them all before I reach my bed at night. That means, those high end games and my other office apps are kept minimised throughout the day keeping the background app refresh active! If this was a case in a Nexus 7, the tegra 3 quad core wouldn't allow you to keep these many high end apps in the background as when I was testing nexus 7 by playing Real Racing 3, I found a reduced details than the iPad, and I found that the CPU usage was much high, whereas even after updating to iOS 7, Real Racing, nor Infinity blade or Asphalt 8 has reduced a bit a quality!! The battery life of iPad amazed me since the day I'm the owner of it. Apple promises of 10 hours of battery life, and it keeps its promise with heavy game play and provides more than a day backup on medium use with garageband and traktor dj with medium game play! Just awesome!!! Also it is the best to read eBooks and the iBook interface? Every one will be getting envy on you on seeing the interface.. <br>\nI was low on budget and I just wanted to have an Apple device and so I bought a 16GB, wifi version iPad mini, but you know what? I fell in love with it. So light. So sleek, so beautiful, the classic built and the fine cut edges makes its look much more appealing and premium and I think the engineering on an Apple device makes it more pricy than others.<br>\nYou can view all types of document file formats from .pdf to all other Microsoft Office formats. For better viewing download the app Document by readdle and you are open to all. Well there is no free document editor for Android also, you have to buy. In android, piracy is allowed which is strictly prohibited in Apple, so be legal by buying apps. There are paid apps like polaris office, or Quick office for your iOS to edit Microsoft office documents. These are also priced the same in Android. One of the best thing in Apple is that, you have to keep your eyes open to get your favourite premium apps for free as apple features them in App of the Day or App of the week. And you'll never get them free in android!! And you need not buy apps cz each and every app in the app store has anreal quality unlike in the Google Play store. About the mail attachments, you can mail multiple attachments at a time using the app Documents by Readdle. But you cannot email music as again apple takes care of the privacy. You cannot send music. You cannot download music from other websites using the browsers. The browser will play the music but won't allow you to download, you can again use Document by readdle to download music. And iTunes have each and every music from local language music to hindi... It has a vast library!!!!<br>\nOne of the best feature of Apple devices is that you'll get several updates and not just one or two or maximum 5 like in Android devices.<br>\nI had more to say but I need to sum up. I sum up by saying that I have spent my ₹21900 for buying a gadget, and this gadget is returning me back each and every penny by its service!!! Still no problems yet!!!<br>\nI love my iPad mini..l                                </span>", "<span class=\"review-text\">\n                                    I got these from flipkart  on 31st August.it is a fantastic device for gaming, video calling and for all the things that are necessary for a tablet. It doesn't have retina display but still the display is very good.runs all heavy graphics superbly without any lag. And Apple gives software updates frequentl.<br>\nRear camera takes some decent photographs in light and front camera is superb. Don't feel that ram is too low (512mb) it runs everything fine without a single lag issue.so worth buying it.                                </span>", "<span class=\"review-text\">\n                                    If you are planning to buy. Buy this. Very good product.<br>\nNobody in the market can compete with Apple till now (not Google Nexus not even Samsung and not even Sony Xperia tablets). The only competitor for Apple is themselves.                                </span>", "<span class=\"review-text\">\n                                    Flipkart were quite quick to deliver this within 2 days. <br>\n<br>\n+ Great tablet, not retina but Magazines, Comics look fantastic. <br>\n+ good premium feel, size is perfect.<br>\n<br>\n- Stutters on occasions.<br>\n- bit pricey for non retina display.                                </span>", "<span class=\"review-text\">\n                                    Guys I purchased the apple IPad mini 10 days ago<br>\nI have bought a 32gb iPad mini and I'm loving this experience<br>\n<br>\nI was using galaxy s2 and had a lot of problems after 6 months .<br>\nThe phone lagged like A snail.<br>\n<br>\nI prefer apple over other handset makers because its simply the best<br>\nThere is no virus in the apple networking<br>\n<br>\nI have downloaded high graphic games like temple run2 , shadow gun, nova 3,infinity blade and modern combact . The device neves lags or hangs .its perfectly smooth as butter.<br>\n<br>\nThe touch is outstanding compared to the galaxy. I am a gaming freak.<br>\nAnd for all gaming freaks this is the best buy.<br>\n<br>\nIf you go for phones .it offers you just a 5inch screen which is absolutely not bad, but nothing like having the experience of an 8inch screen.<br>\n<br>\nThe iPad 2,3.4 is too big and is very hard to handle. The iPad mini's size is perfect.<br>\n<br>\nBut the camera is disappointing. I know it only offers a 5mp camera but the images when zoomed in and shot is very shabby and is very disappointing. There is also no flash available with the camera.<br>\n <br>\nSome people thing that the apple devices is very restricted. Reviews from apple haters are <br>\nMy god I feel suffocated and all those crazy stuff.<br>\n<br>\nI know it's prey irritating to download songs from your computer, put it inside iTunes and transfer it to your apple device but it isn't a herculent job either.<br>\n<br>\nAndroid flagships are nothing compared to the mighty apple devices.<br>\nI ensure you guys the iOS is very simple and user friendly.<br>\nThe android phones like s4, s3 are very heavily loaded with features  and these phones lags.<br>\n<br>\nThough these phones may offer you a quad core processor but it simply sucks.<br>\n<br>\nThe iPad mini also runs on the latest iOS 6.1.3 which is trily awesome.<br>\nIt looks attractive and rich.<br>\n<br>\nGuys but be careful the device is too delicate and may break if it falls down .<br>\nEnsure its in the flip over<br>\n<br>\nI hope this review will help you make a good choice                                 </span>", "<span class=\"review-text\">\n                                    I have used so many electronic products...but I must say this was the best what money can buy.....Ebboks, newspapers, Social networking, Video calling, Email and especially games  and lot many mind blowing apps....and i have used other tablets such as samsung, nexus...but ipad is way beyond all those....and best thing battery lasts for close to 7 hrs when ur using wifi...and best part it doesn't get heated up unlike other devices...<br>\nIf you are a first time user of apple devices...you make take some time to get along with itunes,syncing and others... you may feel few thing are restricted....but once start using it..you will never look back.<br>\nGo for It!!!!!                                </span>", "<span class=\"review-text\">\n                                    Everyone out there is comparing the Ipad mini with other tablets in the market especially Nexus 7.Let me tell you one thing first :<br>\nDo you want to run the Benchmarks in your tab and say hey my tab has 1500 geek score or do you want to feel the performance of your tab.<br>\nIf you observe the gaming in both these tabs (NFS MW) you will never look at nexus 7 again in your life.even though it has 1500 geek when compared to 750 of mini...when it comes to performance the scenario is completely reversed..<br>\nIn case anyone interested in comparing geekscores, better compare the ANDROID tabs, phones (SAMSUNG,SONY,HTC,LG) but never ever involve APPLE in this aspect because Geek score is the representation of Hardware mostly but where is the perfect sync between SW &amp; HW. All these companies are assembling diff processors,GPUs and saying dual core quad core oct core n Hex core,but remember guys whatever may be the core in those phones or tabs APPLE can handle them with its dual core 1Ghz Processor thats for sure.<br>\nMost important of all is the hardware degradation:<br>\nUse nexus 7 for 3-6 months and again run your fav app it will give you no more than 1000 and after 1year 500 after that tab wont be able to run that app either..that wont happen in case of Apple products Use it for 2,3,4 years the same performance,same graphics,same score..Those who cant afford 22k better wait till you can afford 22k, but dont go for cheap tablets,In case you definitely want tablet and cant afford 22k then go for nexus 7.                                </span>", "<span class=\"review-text\">\n                                    First of all hats off to flipkart for the express delivery...less than 48 hrs that's just awesome.<br>\n<br>\nAbout the product its great device.best thing about it the battery life more than 10 hrs whatever you do that's superb.screen is decent .software experience is smooth that's what u expect of iOS .app collection is also good .<br>\n<br>\nAbout the cons <br>\n<br>\nHad hard time to get a decent flash browser.<br>\nAlso memory ....as u can't connect external memory without jailbreak it's hard to contain with 16gb .but I checked the net for some getaway and come to know that their are few wireless card reader which can read even external HDD .<br>\nI would like to request flipkart to ship this kinda things as well.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Yes, i agree apple is apple. But Google is nothing less at this stage. Nexus 7 can be double its price in india, but its totally worth it. ipad mini and nexus 7 both are great, the difference being ios and android. Decide which os you will be more comfortable with and then buy. If you are a casual user go for ios. But if you want to explore your device, customize it according to your wish, don't think twice, go for android. Android is the fully customizable os while ios is a simpler one with less options for exploring. And particularly for this device what i feel is that nexus 7 is a little ahead for some reasons. But the final choice is between android and ios (i went for android for its wider interface, where you can do a lot without rooting). Choose wisely....                                </span>", "<span class=\"review-text\">\n                                    Even though Nexus 7 might have better specifications than the iPad Mini, iPad mini will be the better experience for almost anything you do in real life.<br>\n<br>\nThis is because apple's iOS is much, much stable and proven than the android OS. in iOS, there is a perfect play between the Hardware and the software to bring out the best of what is in it. Android products need to have much higher specifications to get the same quality because Android is still a kid compared to Apple's iOS. <br>\n<br>\nBottomline : Buy Apple iPad Mini if you want the best eventhough it is little costlier<br>\n<br>\nBuy Nexus 7 if you want to customize you themes, download applications for free, etc, etc<br>\n<br>\nI would buy the iPad mini anyday of the year                                </span>"]}]