[{"date": ["<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                29 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                22 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                30 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                06 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                25 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                25 May 2014                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Moto E best Phone for the Price - Moto finally understands indian market                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Issue with Back Panel ! Its not made with precision settings :(                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Just Found one major flaw in the Moto E design.....                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                MOTO E, all you need to know!!                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Cut the crap if you can't appreciate this finest piece of gadget.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Ultra Hyped because of Ultra Cheap Hardware from Rivals                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Back cover became very loose.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                USED FOR 7 DAYS AND REALISED THAT IT IS NOT AS GOOD AS I THOUGHT ABOUT IT BEFORE ORDERING                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                its bye bye micromax n samsung.                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Haters will hate!                            </strong>\n                            </div>"], "link": ["/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/moto-e/product-reviews/ITMDVUWSYBGNBTHA?pid=MOBDVHC6XKKPZ3GZ&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "desc": ["<span class=\"review-text\">\n                                    A big applause for Flipkart for delivering the product &lt; 12 hrs of placing the order .<br>\nOrdered the Product 12:01 AM and received it by 11:30 AM .<br>\n<br>\nMoto E(white) <br>\nLook/Feel : White is looking good and the finishing of Phone doesn't look like a 7K phone , it looks quite premium <br>\n<br>\nHandling : Since the phone is curved we can hold the phone in hand quite easily .<br>\n<br>\nAndroid UI /Response : downloaded few gaming apps and tried the android 4.4.2, its silky smooth with this Hardware.Not much lag is observed . UI response is really good .<br>\nMoto Migrate is a good feature .<br>\n<br>\nCamera : No Flash , don't expect a great pic from this 7K Phone .Average quality picture<br>\n<br>\nBattery : with Wifi-enabled browsing / playing videos /Music/games for past 8 hrs still battery of 50%  left.<br>\n<br>\nCons : Camera Flash could have been included .<br>\n<br>\nOverall : Moto has finally understood the Indian market and released a Phone with right features at a very competitive price . <br>\n<br>\nUpdate after 20+ days of Usage :<br>\n<br>\nPros :<br>\n* Long lasting battery : 24 hrs+ with Wifi + Music + 2G/3G data + Avg Voice calls (2 hrs)<br>\nGood to really use a smart phone for a whole day without intermediate charging.<br>\n* Pure Android Kitkat UI is smoother and looks simple to use with no overloaded features.<br>\n* Moto Migrate, Moto Alert &amp; Moto Assist are really handy &amp; useful apps.<br>\n  Regularly I use Moto assist, it sets my phone to silent mode during meeting - timing it grabs from my calender.<br>\n* Resolution is top notch HD Videos/ photos viewed gives us a rich feeling .<br>\n* Phone built has the premium feel and grabs lots of eyes.<br>\n <br>\n<br>\nCons :<br>\n* Day time camera is good .low light camera is poor due to absence of Flash<br>\n* User removable battery should have been there.<br>\n*Internal memory space should been more.<br>\n<br>\nOverall don't expect all the features supported in a INR 20K+ smartphone .<br>\nFor the price we have paid it gives us a great android experience.<br>\nIts a best buy for the price we have paid. Moto E will be budget smartphone leader.<br>\n<br>\n <br>\n<br>\n                                  </span>", "<span class=\"review-text\">\n                                    I am sure most of you would have found this fault in your respective phone by now. The Back plastic cover is not fitting accurately to the phone and due to this, the loose end hits the SIM card and eventually the SIM comes out. I experienced this a lot of times and first I thought it was due to my bad SIM, but then when I talked about this to other Buyers, OMG ! they all faced the same problem.<br>\n<br>\nFlipKart - Do you have any idea about this? Please check this defect atleast in the next set of Phones you get from the Manufacturer !                                </span>", "<span class=\"review-text\">\n                                    Hello Readers,<br>\n<br>\nThe overall performance and other aspects of this phone are excellent but there is one major flaw with the moto e back cover/shell design.<br>\n<br>\nIf you try to remove the cover multiple times, it will not fit complete into the phone and will come out a little bit.<br>\n<br>\nThis sounds a little cheap and I did not expect this from such a quality phone which is advertised as \"Build To last\"<br>\n<br>\nBeware, if you are going to buy multiple shells and flip them frequently then you are going to damage them after few days.. (and FYI shells cost Rs900 which is EXPENSIVE)                                </span>", "<span class=\"review-text\">\n                                    Moto E is all set to be the gamechanger in the budget android phones battle. Here are the features and reasons you need to remember this for:<br>\n<br>\nPros:<br>\n1. For under 7000Rs, you get Corning gorilla glass, splash proof water resistant coating. Even samsung series mobiles that are close to 20000rs don't provide this. It seriously helps in reducing scratches and adds a premium look to the display as it is glass unlike the plastic covering that you come across in others.<br>\nThe BUILD QUALITY is the BEST HANDS DOWN!! Coming from an OEM manufacturer, the finishing and the quality of plastic used is way better than the 20000rs+ samsung phones.<br>\n<br>\n2. 1.2 ghz dual core processor, snap dragon 200, though slightly an older model processor, combine this with the 1gb RAM and be rest assured you have a butter smooth interface and browsing experience. AT THIS PRICE RANGE, 1.2GHZ, 1GB RAM, SNAPDRAGON PROCESSOR WITH ADRENO 302GPU IS UNMATCHED!!!<br>\n<br>\nANDROID KITKAT V4.4 OUT OF THE BOX!!<br>\n<br>\n3. Since the display is covered over by glass (corning gorilla glass), it looks amazingly premium when you hold it in your hands compared to the plasticy looking samsungs and micromaxes.<br>\n<br>\n4. The qHD (540x960) display with 256ppi density is better than Samsung Galaxy Grand series mobiles which retails for around 18000+. and in real life too, the image reproduction is just unbelievably amazing.<br>\n<br>\n5. It also has adreno 302 400hz single core gpu, which can easily take on some of the high intensity games like FLcommander, latest angry birds, etc., though you will finds lags in the super high end games like NOVA 3 or asphalt 8 etc. but unlike the other phones in this range, it will be able to run the apps, but you cannot expect a lag free experience, but it still does the job when you reduce the graphics detail level.<br>\n<br>\n6. The camera: Only rear main camera. 5 mega pixels. No autofocus. No flash. Yet, this is more than sufficient as this phone proves to do a good job even in low light settings. Please note, there is no auto focus and tweaking the settings a little you can obtain grain free, fine quality pictures even in low light. It does take 720p videos at 30fps.<br>\n<br>\n7. The best feature, which even the moto G and X lacks: SD card support!!! expandable upto 32gb!!!. This more than makes up for the lack of OTG support. Please note 4gb of internal storage is given, out of which around 1.8gb will be already utilized for the android system. Expect around 2 to slightly less than 2gb of free internal storage. It is highly advised you book at least a 16gb sd card.<br>\n<br>\n8. The 1980mAh is sure as hell to last an entire day's usage. Please note the battery remains user not-removable as in the case of moto g and x. With a combination of heavy and moderate usage, it lasted easily for an entire day.<br>\n<br>\n9. It supports 3g, 2g, wi-fi connectivity. <br>\n<br>\n10. The speakers are in the front so it doesn't get blocked when you keep it face up on flat surfaces.<br>\n<br>\n11. Beautiful customizable back covers, you can make you own personal statement now. You can be sure of its quality coming from motorola themselves, much like the ones available with moto g.<br>\n<br>\nAll other sensors are standard with GPS, magnetometer, proximity sensor etc,.<br>\n<br>\nCONS:<br>\nAt this killer price, there is really no CONS to be added. Yet, let me point out to things that the Moto e is lacking compared to its elder sibling The moto g:<br>\n<br>\n1. Moto g has a snapdragon 400 quadcore, this is only dual core.<br>\n2. No led notification.<br>\n3. No flash for camera. No front facing camera!!!<br>\n4. No otg support.<br>\n5. Graphics not sufficient for really heavy and high end graphics intensive games like NOVA 3, Asphalt 3 etc., though they will run with less specifications on graphics detail.<br>\n<br>\nMOTO e is sure as hell built to last and a sure fire game-changer in the indian budget android market in INDIA!!<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Regardless of the quality of the device, which I'm sure is more than what the mass is expecting at this budget price point, I can see some people are busy reiterating the fact that \"you have not used it yet\", \"post reviews after so and so date, else your verdicts are fake\". I'm sure people were expecting this phone to be in the range of 8-9k and they were overwhelmed to see it at 6999, so most of the reviews here are posted because they couldn't help their excitement. I can understand it was their mistake or rather an accident they rated it 5 stars even when they haven't used it. Funny thing is I can't understand is why some of you rated it 1 or 2 stars cause you haven't used it as well! Or maybe you're repenting on your recent purchase which costed you more but maybe not as good as this one. Burn!<br>\n<br>\nAnd as for the phone goes, yeh toh micromax, lava aur xolo se behtar hi hoga (if you're keen on representing chinese made chipsets and build quality).. And I don't see any samsung or sony phone below the range of 10k compete with this hardware. <br>\n<br>\nWouldn't make comments on the performance or usability of the phone yet, I'm just getting ready to get my hands dirty on this one.<br>\n<br>\nReview after hands on 21st May -<br>\n<br>\nNow flipkart kind of ruined the whole party by delivering it so late, I just received it yesterday. Now, coming to the phone itself, the packaging was a bit flimsy but alright. I opened the box, and there lay Moto E, glistening with its gorilla glass 3 display, looked as good as a 15k device. Opening the back cover is a bit tricky, inserted 16GB micro sd and booted up. <br>\n<br>\nDisplay - You all know the specs of the display, it is as good as any you'll find in the price range of up to 15k (best in class). You can observe a bit of pixelation if viewed closely, but from a hands distance, it's sheer viewing pleasure. Movies of 720p play smooth, and even most 1080p videos are working fine in MX Player S/W mode. <br>\n<br>\nUI - Android Kitkat 4.4.2 out of the box, what better can you expect. Stock android feeling with a bit of motorola assistance and security tools to mark its signature on it. The wallpapers look great on this UI, and the experience is fluid even with multiple apps open. Haven't stressed out with gaming but I'm sure on normal usage it would suffice for most users with the hardware it comes with. Snapdragon 200 is pretty snappy and minus the customization of skins which brands like samsung and htc comes with, it is an added advantage. You won't feel compromised at all.<br>\n<br>\nResources &amp; Hardware - 1GB Ram and Adreno 302 will serve most tasks easily. The audio output is also decent, the same google play music app with sound enhancements of moto g is also available, so you are not missing out on anything. Gorilla Glass protection is handy for regular usage. With all apps installed you'll still get 400-450 MB of RAM free on most occasions and 350MB when you're using 5-6 apps simultaneously. There was very negligible lag.<br>\n<br>\nCamera - Bit of a letdown, some people will always complain because of the lack of flash and front snapper, but then again this is a different segment, if they put everything in here as they did on moto g then who will buy moto g? I'm not a fan of camera phones so this doesn't disappoint me. But I still think it does a decent job. <br>\n<br>\nBattery - I expected a little better, not that it lacks power. One full day will last under normal to medium high usage. I used it for two hours continuously with wifi on, downloading and installing apps, listening to music and playing videos. The battery lost 20% juice. So around 10 hours of active usage should be there approx.<br>\n<br>\nGaming - Don't expect heavy gaming, this doesn't even promise you that. But for casual gamers, it is your playground to exploit :)<br>\n<br>\nConclusion - If you want to buy a phone with a budget which doesn't burn a hole in your pocket. This one is for you. If you're in college who is going to buy his first android smartphone and want a premium experience at low cost, this one is for you. If you want to gift your parents or siblings a new phone who never used a smartphone before, this is what you should be going for. If you're a critic for not including HD recording and led flash or front cam, then you need to wait another 5-10 years till they launch iphone @ 10k, because this is NOT for you.                                 </span>", "<span class=\"review-text\">\n                                    After using two weeks, I am not going to discuss specifications of the phone. I will tell you the real pro and cons of the phone.<br>\n<br>\nCons:<br>\n1. Camera : it is a nightmare when you need to take pictures of nearby objects like documents. Otherwise camera will work fine. My Rating 3/5<br>\n2. Heating Problem: Heats very much while playing games like Angry Birds. It is quite normal, but I feel it is overheating a little. 3/5<br>\n3. High SAR Value, Thrice to Samsung n Nokia Phone. A huge disappoint for me. Be assured that you will get headache if used for long period of time.(0/5)<br>\n4. I got a black phone with White color cheap headset. Produce crackling sound at high volumes. Rating 2/5<br>\n<br>\n5. Phone doesn't have a file manager, so be sure to install ES FIle explorer from playstore. Very small issure for me.<br>\n<br>\n6. ON 2 G connection Playstore starts downloading applications but stops in the middle, say after 1-2 Mb of download. You need to disable data and enable it again to resume downloading of app.  On wifi, it works fine.<br>\n<br>\nI have to download apks from other websites, because playstore was creating problems on 2G. 2G connection work very fine and stable.<br>\n<br>\nPros:<br>\n<br>\n1. Touch very responsive. Just like apple's . Auto correct feature is very nice if you are sending messages in English, otherwise you need to train it.(5/5)<br>\n<br>\n2. I installed Temple Run, Subway surfers, Candy Crush, Angry Birds, Moto Racing, No lag so far. Moved apps to SD cards easily.(5/5)<br>\n<br>\n3. Display : Best in class, no bad words(5/5). Got most compliments for its display and gorilla glass.<br>\n<br>\n4. Back cover doesn't feel cheap plastic but do not open it frequently otherwise it will get loose.<br>\n<br>\n5. Notification Light. Nice feature. Turned off by default. <br>\n<br>\n6. Finger print resistant (No). Water Resistant Yes, Water Proof- No, Scratch Resistant- upto some extent.<br>\n<br>\nFinal words<br>\n<br>\nFlipkart is creating hype for it, since in this segment,  Micromax , Lava etc are supplying a hardware only on Papers. They are well known for their non reliable, Ghatia Jugaad hardware.<br>\n<br>\nYou can go for it, actually wait for it, if you can NEGLECT HIGH SAR VALUE AND a useless camera for nearby objects.<br>\n<br>\nYou cannot take picture of documents, signatures , scan a barcode, QR Code  scanning will also get problem if another phone is small.<br>\n<br>\nI hope  you like my review. Any problem, just google with my name and you will get my details.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Back cover became very loose. very worst back body cover. I have opened the back cover 3 time. 1) to Insert first sim 2) to insert Memory card 3) to insert second. Thats all. now the back cover became very loose. It is shaking up and down now. Even the cover is not good how can i trust the other phone hardware are  good. I would recommend not to buy this phone. <br>\n<br>\nI don't expect these kind of product from moto.                                </span>", "<span class=\"review-text\">\n                                    this phone has created so much hype. <br>\npeople are so excited about it that it has gone out of stock in no time.<br>\ni ordered a white moto e on the day of launch and received it in 4 days.<br>\nopened the box and was glad to see this beautiful product.<br>\nafter using it for 7 days, i have faced THREE PROBLEMS <br>\n1) camera is not that good as i expected it to be although i knew that it lacks auto focus<br>\n    picture quality was as good as any 3 MP camera<br>\n<br>\n2)  while making a call, voice of the other person is not clear<br>\n<br>\n3)  the back cover it comes with does not fit properly.<br>\n<br>\ni am writing this review after using it for 7 days.<br>\nnow i have requested the flipkart people to replace it or refund my money<br>\nthey earlier said they can refund the amount but now they are insisting on replacement.<br>\n<br>\ni am not complaining that this phone lacks auto focus, led flash, quad core,etc.because it would be insane to do that.<br>\n<br>\nwhat irritated me is that even the basic features like voice quality in call and camera are not good.<br>\nand then the flipkart return policy, you call them and everytime a new person talks and tells a new story.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    till now micromax were surviving the market with their low costs and we had to compromise one or the other feature, <br>\n<br>\nand on the other hand samsung were fooling the indian customers with their high price tag  <br>\nfinally  Motorola has put an end to this crisis<br>\n<br>\nthans to Moto G in the 14 k range and now ,this monster <br>\nwith<br>\ngorilla glass 3 , snapdragon 1.2 dual core , kitkat 4.4.2  all in 7k !! <br>\n<br>\nwait its not the end, battery 1980mAh battery, dual sim , 4.3 inch display..<br>\n<br>\nif you would have first told me the specs; i would have just said, ' sala hoga koi china maal'<br>\nafter seeing the success of moto G, there should be no doubt that this phone is going to be seen everywhere within a month.<br>\n<br>\n  ps : samsung please go back; moto says ua time is up my time is now :p.<br>\n        sony we dont play kabbadi or swim that much so please .. think wisely.<br>\n        i just lost my phone and was planning to buy lumia 520.:D. thnq moto :)<br>\n                                        </span>", "<span class=\"review-text\">\n                                    Moto E...What a phone! (My first Motorola)<br>\n<br>\nI was going through the list of negative reviews of the phone (217! thats a big number) and decided Ito put forth my two penny or maybe because of insomnia (!) (yeah! at 2:30 am)<br>\n<br>\nI had ordered the phone (as many here did) at 12:00 am on 14th May. Initially I had faced the issue of payment when my account was debited but the confirmation did not come through. I promptly called the customer service and enquired about it to which I was replied that servers issues were there, so it will come through (yeah I got frustrated too, I had just paid 7000!). I waited and sure enough an hour later, the confirmation came through and I got the email (phew!) I had asked for a next day delivery so expected the delivery by 15th May, which happened (yeeaa..new phone!) Booted up the phone, read the spec sheet ( :/) and been using it since without any major glitch!<br>\n<br>\nLessons<br>\n1. Yes SAR value is high but still within permissible limits as prescribed, so don't worry your brain won't turn to jelly (that rhymed!)<br>\n2. GPRS works (duh!)<br>\n3. Has hotspot.<br>\n4. Back cover isn't loose as many have been saying, but that being said, faulty pieces may come up.<br>\n5. Camera sucks, I mean really sucks, its a 5 MP alright, but shooting has to be restricted in day or bright conditions only, but then please don't go comparing with a Micromax of Samsung phones of same price tag, at-least performs better than them, any of them, period. (Have used phones of only Samsung and Micromax in the past)<br>\n6. HD screen??? You guys need an HD screen for 7k?? really?? This phone has got a ppi of 256, isn't that good enough for you?<br>\n7. Heating issues? Didn't face any major heating issues while playing any game yet, minor yes. The only problem is it gets heated up during charging, especially the charger.<br>\n8. Some one compared Micromax something something.and XOLO something something....nope...don't have any words for you. Oh, fyi...motorola MAKES their phones, doesn't BRAND cheap Chinese ones.<br>\n9. Someone said the Moto E is a chinese phone, well done sir! You are right, it is indeed made in China. So is the phone, the laptop, the computer etc. you are using. China is the world's largest electronics manufacturing hub.<br>\n<br>\nFor lovers of this phone! You don't need a review, you know it!                                </span>"]},
{"date": ["<div class=\"date line fk-font-small\">\n                                10 Jul 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                15 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                24 Jun 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                17 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                30 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                15 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                16 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                15 May 2014                            </div>", "<div class=\"date line fk-font-small\">\n                                14 May 2014                            </div>"], "title": ["<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Ridiculous response from Flipkart and Motorola on the faulty Moto E                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Second Impressions (post the euphoria of )                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                MotoE best among class and worth your money                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Very Fragile screen of Moto E... A Big NOOOOOOOOO..                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Excellent features! Rest all your doubts and myths about this 'cheap phone'                             </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                SAR                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Fantastic product                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Back shell is loose                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                MOTO E Rocks.... Read Review Carerfully.. Dont go with false reviews..                            </strong>\n                            </div>", "<div class=\"line fk-font-normal bmargin5 dark-gray\">\n                            <strong>\n                                Best budget phone with premium looks/features                            </strong>\n                            </div>"], "desc": ["<span class=\"review-text\">\n                                    I think Motorola is taking Indian market for granted to dump the poor quality products. Flipkart is partnering in it. The reason for my inference is based on following experience.<br>\n<br>\nI got Moto E delivered to me on 6th June 2014. I started getting problems in charging as well as restarting it after its battery got fully drained within first 15 days. It happened a couple of times. Somehow, I could manage to start it and then charge it by trying various things like, starting while charger is plugged in or starting after charger is disconnected, etc. No general behaviour was found that when and how I can start it and when not! It looked like all random. Now, the problem started aggravating. I kept it for charging for the whole night, found it fully charged up and removed in the morning, say at 8:00 am, and left on the desk idle. At 8:30 am, when I picked it up for making a call, I found that it is off and not turning up by power switch!!! So I plugged in charger (again a random try) and then tried to switch it on. It started but showed the battery to be 1%!!! So (again randomly) I tried a restart. After restart it showed the battery to be 89%!!! So I took it off the charger, made a call or two and left on the desk idle. Again after 30 mins or so, when I picked it up, it was found in off state!!! Repeated the exercise!!! After 3 to 4 such cycles in a time period of 2 days, now the problem has alleviated to yet another level!!! It is just not switching ON!!! No matter how and what you do!!! Charger plugged, plugged for 8 hours, unplugged, whatsoever!!!<br>\n<br>\nBy the time I reached this state, it was about 31st or 32nd day of the delivery, and hence Flipkart denied me of replacement or return of the device!!! Contacted Motorola service centre, They suggested me some battery calibration steps after 3 to 4 phone calls over two days!! Interestingly, the first step in their calibration suggestion says, \"Switch on your device\"!!! Now that is what is not happening!!! So again called them. Ask me to go to Service centre, which is about 50 km from my place in the adjacent city! I requested them to show me some steps over phone to do something. The reply was that, since it was not starting at all, there is some hardware problem. I told that it is more severe then that your device gives such hardware problem within one month. So you should replace it. They said only flipkart or service centre can decide on that!!!<br>\n<br>\nThen I surveyed net for similar problems in Motorola phones and learned that this type of problem is not new to Moto E or to Motorola, it is widely reported on ned even for Moto G. So Motorola knew about this problem and still launched the selling of Moto E without bothering to solve it first. So I think that they don't care of the quality of the product to be sold in India!!!<br>\n<br>\nPeople should simply boycott their products....                                </span>", "<span class=\"review-text\">\n                                    Been over a week since this phone arrived and i will hold on by the previous review i wrote - mentioned below. In the meantime have used the phones extensively and found that all is not \"sunny under the sunshine\" . Some CONS are:<br>\n1) MAJOR ONE - the back covr has become loose. As in evrytime you hold it in your palm you can feel that its sliding a little bit from its position. feels a lot awkward.<br>\n2) BATTERY life - however smooth they make android , its still going to be a power hog..... battery still drains a lost faster compared to lets say a WP handset.<br>\n3) Prone to FingerPrints - be it the back plastic or the glass screen the whole phoen is prone to smudges and figerprints which is kinda undesirable.<br>\n4) the speakers are in the front which can be a good thing or bad , and dont ask me why, but i don't like it much personally.<br>\n5)camera is sub par .<br>\n6) the backpanels launched for a 7k phone are way to expensive at nearly 500 bucks /cover<br>\n<br>\nBUT i will still hold on to the fact that at 7k this phone is very good considering its screens brightness and touch response being much much superior to many other entry level phones in the market. <br>\nSTill lavel itas a BUY for anyone who wants a entry level phone.<br>\n---------------------------------------------------------------------------------------------------------------------------------<br>\n<br>\nFor the price this phone has been launched is just plain ridiculous !! I remember the phones with such specs costing 15-18k couple of  years back (remember Sony Xperia P) . Anyhow just unboxed it last night and here is my take on it :<br>\n1) Screen is awesome for 7k and cant believe its Gorilla Glass 3<br>\n2) The weight is slightly high (more so than Lumia 520 -just slightly)<br>\n3) The design ergonomics is good enough . Doesn't feel plasticky or cheap. MoTO did a great job in designing this CHEAP handset<br>\n4) Network reception was good ,point being that In my area all telecom companies network strength is poor . So this showing up nearly all the bars at ts signal strength was good.<br>\n5) The Speakers are LOUD . Which is a plus for Indians somehow. ;) <br>\n6) Internal Memory is less but then have added a 16GB SanDisk card and its handling it nicely. <br>\n7) Mostly vanilla  Android which is a plus ( until unless its sense 6 :D ) no unnecessary customisations. <br>\n8) It makes an ideal gift - which it was,  for my sis :).<br>\n<br>\nHaven't found any cons yet but can already point out some , having used Android before , the major issue will be Memory utilization and battery performance . So lets wait and see how it turns out to be after a few days performance.                                </span>", "<span class=\"review-text\">\n                                    To all those who are saying it is released today how can one post review...<br>\n<br>\nI had ordered this today ie. on 14'May at 12:10 AM and got it delivered by 01:00 PM using same day delivery option. Flipkart as usual delivers within no time and really worth it paying Rs.140 for same day delivery.<br>\n<br>\nComing to Moto E, I am sure no other branded mobiles are available at this price range and with this specs. All the sepcs related to RAM, processor, Gorilla glass and mostly screen resolution are good. I  recommend this personally comparing the price and spec. I feel it had most but only flash light is missing which if present would have nothing to be improved.  It is really good and happy to share this.                                 </span>", "<span class=\"review-text\">\n                                    I ordered MOTO E on Flipkart on the launch day as a gift for my wife &amp; got it delivered it on May 20, 2014 and within few days the internal display screen broke while it  accidentally fell from just few inches on the desk ..is it that fragile ???<br>\n<br>\nBelieve me this is a serious issue. Its toooooo fragile &amp; the worst part is ..Motorola's Service , they don't have display spare units in their stock &amp; would ask you to wait few months to get the broken display replaced for Rs 5000/- .. <br>\nRidiculous...can’t believe they are charging 5000/- Rs to replace low quality so called Gorilla display for a phone that costs 7K ..is this a another way to earn some easy bucks by fooling customers ??<br>\n<br>\nThe overall phone is good but ..I’m really had a bad experience with its display issue. Even if you get it repaired, how long that will last??<br>\n<br>\nI recently got to know that, Motorola is replacing broken screen for free for their phone users across globe but not for Indian buyers from Flipkart. This in itself explains how low quality screen they have embedded in their phones to suffer end users.<br>\nFlipkart should look into this &amp; get this issues fixed with Motorolo  ..But I feel they are more interested in their Sales count than what customers feel it once it’s been sold.<br>\nThis problem is faced by many moto users…..not only Moto E but also for Moto G ... please search it on Google/ Motorola forums to see the numbers of complaints/issues raised for this low quality display issue .. and the Motorola support has no satisfying answer to this issue.<br>\n<br>\nI would advise buyers….think TEN times before going for Moto E &amp; Moto G.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Collectively, my family owns cellphones from the following brands: HTC; Samsung; LG (my old phone); Nokia<br>\nWhile my LG and dad's Samsung comes in the price range of 12k-15k<br>\nMy sister's HTC One X plus was bought for 28,000.<br>\n<br>\nSoon after buying LG I regretted, the touch interface; graphic display; processor speed is  not upto the mark. Bought two years back and having spent 12k on it, I was carrying on with it  but was on a constant lookout for a better phone. Ever since Moto G hit the market, I was almost convinced to buy it, and then on Wednesday, 14 May I saw the full paper ad in TOI which read: Rs.6999 Moto E!<br>\nI logged in instantly and ordered this phone, even though there was very little user knowledge on it (since it was launched that very day!)<br>\n<br>\nThis phone was delivered to me yesterday (in flat 2 days, way before the stipulated time) And yes it feels good that its out of stock :D<br>\nComing back to the main point (reviewing the product, guess the avid blogger spirit and me cant refrain itself from setting up a good background to a story...)<br>\n<br>\nA) The phone is way beyond what you see in the videos and promos online, it blows you away with the graphic display, excellent touch interface and is way better than any Samsung or LG phone <br>\n<br>\nB) You will have to pinch yourself to believe, it cost you just Rs.7000!<br>\n<br>\nC) For those who like to click away from your phone, Caution: This phone does not have a front camera or a back flashlight and does not auto focus. But for others like me, who hardly bother and the love of photography is practiced by using 'cameras', this will hardly make any difference in your MotoE experience! <br>\n<br>\nD) The body of the phone is sturdy (not cheap looking at all!) I bought a white one and am looking forward to booking a nice MotoE cover when it will be launched next week.<br>\n<br>\nE) It has all the features of any Android phone. Caution: The processor is dual core processor and just to bust the myth: this does not slow down the phone system in any way <br>\n<br>\nF) I am not a hard core heavy gamer (certainly not on my phone!) so I am not sure how this processor will react to heavy games (please refer to reviews given by any gamers in this respect)<br>\n<br>\nIn short, for a person like me who wants to use a phone like a phone plus at the same time wants ALL Android features, Buy this phone, it wont disappoint.<br>\nThe biggest achievement is it beats all those mediocre phones in 12-15k range!!<br>\n<br>\nWe were being fooled by these phone companies till now, MotoE is loyal to its customers and gives respect to them by giving superior features in this affordable price range!<br>\n<br>\nCome to think of it, If I could live with my stupid LG (12k) phone and dad's Samsung Ace plus (15k) for two years, I will be more than happy if this 7k lasts for the same time!<br>\n<br>\nSo dont think on it, go for it. Save the money for better and meaningful things in life (like your education or any other essential electronic!)<br>\nMove away from the consumerist/materialistic picture Samsung and Iphones paint which makes u to believe you can have the best only by spending 35k or 40k!!!<br>\n<br>\nAmen! <br>\n<br>\nP.S. This is revolution! Getting all these features and 1GB RAM at Rs.7000 proves that good technology can be affordable and can have mass appeal! <br>\n                                   </span>", "<span class=\"review-text\">\n                                    Someone mentioned here that SAR value is high, so I though of checking it up on motorola site, and below text is copy paste from their site for Moto-E<br>\n<br>\n\" The highest SAR value for this model phone when tested for use at the ear is .76 W/kg*** While there may be differences between the SAR levels of various phones and at various positions, they all meet the governmental requirements for safe exposure\"<br>\n<br>\nSource: http://rfhealth-sar.motorola.com/SAR/english/sarEnglish-results.jsp?standard=ICNIRP-1&amp;prodid=Moto+E+-+XT1022                                </span>", "<span class=\"review-text\">\n                                    ...Review are given above somethng wrong but product is really very nyc..it cost 7k bt looks like more than 11k....<br>\nsuperb build quality n function given in mob are working very smooth <br>\ni bought it for my Daddy....cz of rough n very tough use of mob in my Dad pocket with keys nd other rough material.....this phone with Gorrila glass 3 wd smudge proof coating full fill the very much need of my dad expect working....<br>\nFirst it has android 4.4.2 kitkat ver. in 7k which is cheapest ever wd gaurantee update to higher ver. when comes.....<br>\n<br>\nit's design look brilliant and ultra fast 1.2 ghz QCmm dual core CPU<br>\n+<br>\n400Mhz Andreno302 GPU(more faster than lumia series n canvas magnus)  +<br>\n DDR2 1 GB RAM <br>\nhas great working capacity wd whole 1.5 day battery back up <br>\n<br>\nnd very very clear edge disply of 225ppi wd qHD of 720p resolution <br>\nvideo play back 89* angel <br>\nveiw has a very decent apperance nd protectiiing glass GG3<br>\n******<br>\n******<br>\nReview related to it that its has Wifi hotspot n tethring option <br>\n.........Don't wrry guys the news is very appreciable that it is fully functioned wd Bluetooth hotspot n USB+ wifi tethring....<br>\n<br>\nI like to buy motorola phone that perspect a good brand value<br>\n*****Old is Gold****<br>\n<br>\nCamera quality is pretty good as well as HRD ....<br>\n<br>\nMicro sim slot as usual ....<br>\nsound quality is so much pretty.....Motorola  is well known for its soung quality<br>\nhandling is so wd ease <br>\ndecent look wd pure white colour nd mxxt wd changable back cover(offer has 50% discout)<br>\n<br>\nGPU(400Mhz)...+ 1 GB ram helps it to multitaking wd so ease n fun .their is no lags or slow down whole day working...battery end up to 50% after exccesive use(wifi+3g netwrk+surfing+gaming+video playback)<br>\n<br>\nHigh HD gaming experiance (it has some lags in  super ending game like Nova3,Alfaults 8,,,,which requires more than 450mhz dual core GPU...cost more than 20k...what do u expect in 7k...which give much more u need)<br>\n<br>\nSuper navigation system nd a cute white light notification<br>\n<br>\nFinally...... I used to say GO for it......<br>\nit's brilliant, decent ,,,,,,,,Aur ky2 kah Doooooooooo yr......lv it so .... <br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    First things first. As usual fast delivery by Flipkart with neat package!<br>\n<br>\nHowever I found a weird thing about this mobile. Initially I removed the back shell and inserted my SIM and MC. When I covered it back, I noticed that it's not fitting correctly. Slightly moving UP and DOWN when ever I plugin the charger or my ear phones.<br>\n<br>\nDid any one face same problem ? <br>\n<br>\nGiving it 3 stars for this build glitch.<br>\n<br>\nAnd yes, Mobile is awesome. It definitely looks like a &gt;10000 mobile. I'm very very impressed with the performance.                                </span>", "<span class=\"review-text\">\n                                    <br>\nBest in Moto E:-<br>\n<br>\n1) 4.3 Inch screen for just 7k.. You Max get 4 inches screen for 7K ( Sony Xperia E &amp; Samsung Galaxy pro in comparision).<br>\n2) Kitkat O.S just for 7k? Unbelievable the device orginally comes with 4.4.2 intially , need not to upgrade.<br>\n3) 1GB RAM ,, Its running too gud.. I installed Around 25 Apps as of now ,, Its too gud..<br>\n    and equivalent Dual core processor.<br>\n4) Gorila glass, scratch resisitant , water resistant .. This specs will definetely make an advantage.<br>\n5) And near by 2000 Mah.. Its good on that range ,, Even Now a days every one carries Power bank as back-up...<br>\n6) The Design &amp; look is too good. Motorola Rocks..<br>\n7) And finally its Motorolla .... So No more market for Micromax &amp; karbon on basic mobiles..<br>\n<br>\nDis-Advantages:- <br>\n<br>\n1) 5MP camera.. Less quality.... Not clear... Taken Random pics.. Not so good<br>\n2) Speaker  was not so good. Sound clarity is bit not clear.<br>\n<br>\nSo Select Your mobile Widely based on what you required... Cheers...<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Received within 12hrs ( SDD) , thanks flipkart :).<br>\n<br>\n- Phone seems little heavy when compared to moto g.<br>\n- Its fast. Playing games, browsing web, locate places in google maps without any interrupts/slowness. <br>\n- After full charge, till now ( close to 6hrs), charge is 78% - wifi on, couple of youtube videos, email sync every 5 mins. So battery is pretty good.<br>\n- Camera is manageable. No front facing camera , shouldn't be a problem for non selflie fans.<br>\n<br>\nOverall its a good deal, in 7K - just go for it.<br>\n<br>\n                                </span>"]},
{"date": [], "title": [], "desc": []},
{"date": [], "title": [], "desc": []},
{"date": [], "title": [], "desc": []},
{"date": [], "title": [], "desc": []},
{"date": [], "title": [], "desc": []}]