[{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    I am writing this review after 6 months of use(I am a heavy user and i play a lot of games)<br>\nPros:<br>\n1. Superb display in this segment.<br>\n2. Good battery backup(it looks like stock android only) <br>\n3. Not much apps running in background like samsung due to which XOLO q1000 is LAG free.<br>\n4. All apps can be moved to SD card so storage is not a problem.<br>\n5. Camera is good.(can record 1080p videos).<br>\n6. A must app XOLO POWER increases the battery backup to 40% more.<br>\n7. U can play almost all games(i have played NFS most wanted, NOVA 3, ASPHALT 8, DEAD TRIGGER 2, FIFA and much more heavy games)<br>\n8. once it fall down from my roof(around 15 feet) still it survived (though i got some scratches on back side), thats the build quality of the phone.<br>\n<br>\nCons:<br>\n1. No back Cover and software update available till now.                                </span>", "<span class=\"review-text\">\n                                    You are on your own luck if you buy this product. Its service centers are providing very poor service all over India and you may have to wait around 1 month to get back your phone from repair.<br>\nmy phone is with them from last 1 month.                                </span>", "<span class=\"review-text\">\n                                    i am using this mobile for more than 3 months.. its very nice and so far so good... only the internal memory is less.. if it is increased this mobile is so super                                </span>", "<span class=\"review-text\">\n                                    The look and feel of the phone is nice. It is thin and sleek. Must handle it with care as it has a slight tendency to slip.<br>\nThe box contents are shipped in the same colour as that of the phone. There is a scratch guard included in the box content. Take care in applying it. The scratch guard are seldom available in the market.<br>\nThe 5 inch HD display is sharp and brilliant. The touch sensitivity is great.<br>\nMy Xolo Q1000 was shipped with android 4.2.1.<br>\nThe HDR picture and full HD video clarity of the rear camera is very decent. The front camera also looks good with the BSI sensor. The camera button of the phone is placed in the wrong spot because while pressing the button the camera lens and the flash is blocked. The projection on the rear camera can scratch its glass while placed on a non smooth surface. I would recommend a smooth pouch instead of a case for the phone to protect the rear camera glass.<br>\nThe costumer care call centre of Xolo is not satisfactory.<br>\nDo not complain for battery backup if you are a hard user. If you are a average user, you will be surely satisfied with the battery backup.<br>\nIt would have been better if the phone had a compass.<br>\n<br>\nPros:<br>\nDisplay<br>\nTouch sensitivity<br>\nThin and sleek<br>\n<br>\nCons:<br>\nCamera button<br>\nRear camera projection<br>\nCostumer care call centre<br>\nLacks a compass                                </span>", "<span class=\"review-text\">\n                                    nothing is good...... no service nothing.... if negative is there i will rate negative.... i don have worst worrds to explain.... please dont buy this mob......                                 </span>", "<span class=\"review-text\">\n                                    I m a xolo user and its hardware is a big problem.<br>\nWhen you look at this phone, it gives you a premium image and you feel the build quality also great.<br>\nHowever, problem begins any time. For me it started with in 3 months.<br>\n- Ear piece stopped working. I mean I could not hear to anything spoke to me, however loud speaker worked. Took the phone to dealer from i bought it. He asked me to contact XOLO care and then do accordingly. Kept trying XOLO care and finally logged a complaint. But no response what so ever! Then went to a care center on CMH road, Indiranagar, Bangalore to give it out for repair. Ended up figuring out that place was just a collection center and repair would happen somewhere else. To my surprise there 4-5 people more with XOLO phones with different models who had exactly same problem as I had. This gave me enough indications that XOLO phones have their hardware bad.<br>\nThen I asked how long would it take to get it repaired and got know that minimum 10 days!. Mind it minimum 10 days!!! There was another customer standing there who was disgusted, and informed that his mobile is in service center from last one month!!!!<br>\nThen immediately decided that I will get it reparied outside and got the speaker thing fixed outside for 1000/-<br>\nNow, I have issue with GPS. GPS is not working!!!. Keeps searching for ever!!!<br>\nSo, no more XOLO phones again, Sorry XOLO guys, you just suck                                </span>", "<span class=\"review-text\">\n                                    I love this phone when its come first time in my hand. Look is great and its performance is amazing. i am using this phone for about 4 months and i don't find a single lag or hang till now.Very little lag when heavy games like Frontline Commando playing.                                 </span>", "<span class=\"review-text\">\n                                    Bang for ur buck (in terms of hardware). I have been using this for 4 months, bought thru _bay.in. Running multiple apps in parallel is just a breeze. My last phone was LG P500 - excellent hardware, on which I was still running Android 4.2 without issues :-)<br>\n<br>\nQ1000 has(or rather HAD) issues. Of the two SIM cards, one stopped working which needed an occasionally reboot - or swapping of the two sims to different slot(only one SIM had 3g data, was a pain). Random reboot once in 2 months. Lost the default launcher, keyboard settings on every reboot (v.v.annoying for me) and lock screen was not customizable(ie, adding music player widget or message widgets on the lock screen), FM radio reception was fluctuating and had a below average camera software with a bad auto focus.<br>\n<br>\nNow for the reason I am giving it 4 stars:<br>\n1. Build quality very good. After dropping a few times, only minor scratches on back cover. Wifi and 3g speeds are blazing fast, bluetooth works. BEAUtiful screen, simply awesome. Earphones are OK, Viper/AC!D audio engine (ACID break video recording) etc makes audio an amazing experience. Camera is decent (stock camera app and stock ROM are crappy), auto-focus speed is an issue. Graphics is awesome, video playback is very very good (but i don't play much games, so cant comment about battery life). In general, with moderate to heavy use, battery lasts a day and a half.<br>\n2. Most of the issues were solved by software and custom ROMs. This hardware is the same as Cherry mobile Omega HD 2.0 of Philippines. There is a very active Facebook page with a lot of custom development happening for this hardware. I was able to root it easily. I have been running various custom ROMs - galaxy s4, s4 mini, hdc s4, miui. About to test the xperia Z1 and Lewa OS. Very happy with the Lenovo super camera and super gallery applications.<br>\n<br>\nAlso have a Q800 in the family, no issues there either. XOLOs choice of hardware is good. Software is simply crappy. As for their after sale support, touchwood, thank god, insha alla, I have not had the need for them yet. As close you can get to S4 at this price.<br>\n<br>\nUpdate: Using it now for over a year now. This phone has seen quite a few falls - few dents and metallic rim damaged at a few places. I didn't put on screen guard after first 2-3 months or use - screen is STILL pristine thanks to the dragon tail glass. My last three custom ROMs(kitkat based) gave good boost to available RAM. CPU and GPU still going strong, though battery is at the end of its life. The glass on the back camera has developed scratches due to my rough usage. As good a new gen phone quadcore CPU like MTK 6582, better in some areas.                                </span>", "<span class=\"review-text\">\n                                    high on features but the navigation present is not good , the lack of magnetron sensor makes it inaccurate........                                </span>", "<span class=\"review-text\">\n                                    I had purchased a XOLO X900 for Rs 17500 in the month of November 2012, with a one year guarantee, suddenly in the month of May I started facing network issues, against which I tried contacting the customer care, I had to call for more than 50 time just to get my Cell phone picked up for repair, Finally After 20 days of continuous call ans series of mails the handset got picked up from my address, and was sent to Delhi Service centre. As per there company policy i was suppose to get my hand set back after 5 working days, but i waited for 20 long days, I got my ph. Back, when I received it, I discovered that the problem was not resolved and they had sent it back to me in the same condition, I decided to keep quite for a month, I decided to came down to Bangalore, thought i would personally go get it repaired, and so i did, i made a ph. Call to the customer care took another complain no. and dropped my handset in the service centre myself as on 12/9/2013 , after a month they say that we cannot do anything about it, as the company has stopped manufacturing the network censors. So the offered me for a refund of Rs. 10000 or other handset worth 11300. IS it the costomers fault or the companies fault, why do I have to bare the loss for company, now the company is doing nothing but cheating people, if they knew there is some defect with the handset then why did they choose to sell it in the stores??? Its been more than 6 months that i have been facing the trouble.                                 </span>"]},
{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    I bought this phone for my sis and she is very happy with this phone.<br>\nBuild Quality is OK <br>\nPhone feels very smooth to use.<br>\nAudio amplitude is a bit low so music lovers may get frustated about this.<br>\nLooks are very good .<br>\nTemperature rises a bit.<br>\nGaming performance is good like other similar devices.<br>\nDisplay is also very good.<br>\n<br>\nNegatives is only the audio amplitude other than that very good device.<br>\nBTW XOLO Devices don't give good aftermarket services and they don't reply to their online emails and \"reach us\" section. So think it as china phone only. Don't keep good hopes from XOLO                                </span>", "<span class=\"review-text\">\n                                    This phone heats up really quickly due to the quad core processors and switches off. <br>\n<br>\nDo NOT make calls on this phone or keep the internet on if you buy it. Pretty good smartphone aye?<br>\n<br>\nIt's been nearly 6 months since I made my complaint and now finally Xolo has agreed to replace my phone but are not ready to give the same phone. I'm currently negotiating for a Q800 although it's most likely that they might give me a Q700. Impeccable customer service :/<br>\n<br>\nThis is worse than the worst China made phone one can ever think of. Buy at your own risk. If you think my review was flawed, please visit other websites and reviews, this phone lasts for a maximum of 1 year. <br>\n<br>\nStay away.                                </span>", "<span class=\"review-text\">\n                                    I bought this phone 3 days back but its giving me problems.<br>\nPower button is not working properly.<br>\nPhone is randomly switch-off and switch-on , even not able make a call.<br>\nCustomer care I tried to call but its not usefull                                </span>", "<span class=\"review-text\">\n                                    First off, I did not purchase the phone from flipkart. but still thought will give warning to all those who are planning to buy this phone..<br>\n<br>\nPurchased this phone in June first week. <br>\nthe Problem started in the first week itself, Display started flickering. after shutdown and downtime of 4-5 hrs, it returned to normal.<br>\nThen after 1 month of purchase, the Display went dark, unable to see anything, this would randomly happen for couple of hours then return to normal all by itself.<br>\nafter that for 3 days it entirely went dark.<br>\nthen since last 3 days, the display has gone Opaque, with overlay of vertical lines, making it hard to see anything. <br>\nSo ultimately bad decision to buy xolo.<br>\n<br>\nAnd the customer care is non-existent, sent an sms from phone itself, but no call back.<br>\nWrote a mail but no response even after 4 days of sending them a mail.<br>\noverall  a very bad experience.<br>\n<br>\nDont Buy.                                </span>", "<span class=\"review-text\">\n                                    Never buy any product from this pathetic company with the worst of services and after sales. You keep mailing them regarding any query and problem and they will NEVER get back to you. My Xolo went dead in just around 25 days and to get it repaired, I first had to call customer care number which got connected in half an hour after several tries and file a complaint. Then I had to send the device to a collection point around 25 Kms from my place. They will send the device to service centre which is 4 Kms from my place just because I cannot go directly to the service sentre. They claim to repair the handset in 5 days. Its 10 days now and there is still no update on the handset. They keep saying to wait for another 48 hours. If you want to buy a handset from such a company, then God Save You. If you think this is a fake review, my complaint number is 310000081294 Xolo Q1000. Try it by calling their customer care number.                                </span>", "<span class=\"review-text\">\n                                    How to play games like nfs most wanted,asphalt,Nova 3,Real Racing because apps are by  default installed on phone storage.This games have an extra files which are in excess of 1.7GB provided in the phone memory...i have tried swapping,link 2 sd..none of them are working..pls do help...waitn 4 rply!!                                </span>", "<span class=\"review-text\">\n                                    though magnetic sensors seems to be built in, it IS NOT working at all.<br>\nXolo site previously said it has magnetic sensor, but now they removed this feature it from their official site too. IT IS THE VERY BASIC feature for GOD's sake. PLUS awful customer service. Tried calling, emailing, but all was in VAIN.                                </span>", "<span class=\"review-text\">\n                                    Its the best because of mainly these feature difference and secondly due to better quality in comparison to other Indian smartphone makers and features like OTA updates.<br>\n1.Its has IPS display with 5 finger multi-touch and scratch resistant Dragon trail glass.<br>\n2.Its does record and play in 1080p and also best camera due to BSI sensor in front and back cameras compared to only 720p and no BSI sensor of canvas HD.<br>\n3.Preloaded android 4.2 jelly bean compared to 4.1JB of canvas HD.<br>\n4.Better battery with 10hour(3G) and 14 hours(2G) compared to 5/6 hours of canvas HD.                                </span>", "<span class=\"review-text\">\n                                    Hi All, <br>\nThank you all for your feedback. I was planing to buy this phone buy you guys have opened up my eyes. In India companies do not care about customer. They just provided pathetic product/service and make quick money and run away.<br>\nInsted of spending million on TV promotion, gettin TV start to promote their phone, they (LAVA) shaould have opted to improve service/product quality and increase customer satisfaction.                                </span>", "<span class=\"review-text\">\n                                    Something is wrong with the xolo brand &amp; lots of retailers stopped selling xolo because of defective products and poor after sales service......! It is good phone, I agree But If m paying  13K for this phone, then I expect good sales service......! And what we can do with the warranty of 1 yr, If we not get proper customer support..................! <br>\n<br>\nSo frds If 13K value for U then avoid there irresponsible BRANDS.....At this point U can get SONY M, SONY L, NOKIA LUMIA 620............! At lest ur money is Safe and SONY mobiles are more durable with awesome sound quality in the headphone.......! Even U can go for SAMSUNG, low range of SAMSUNG product are garbage....only higher range of SAMSUNG mobile are good example;- NOTE 2, NOTE 3, S3, S4, and one Average phone GRAND......., Other then there SAMSUNG is good for nothing......! <br>\n<br>\n   <br>\n<br>\n                                </span>"]},
{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    The price is slightly Higher compared to other . Infact better products (higher specs) Like Wammy Passion from Wickedleak which has sold in very high quantites and is almost same if not better on specs. My freind got one. I like Xolo brand but the price seems high. Xolo should reduce the price if the are looking to sell more as i saw an handson and this set is no differet than micromax a116 or wammy passion.                                </span>", "<span class=\"review-text\">\n                                    i had taken xolo opus 1000 3months back and now its touch screen is not working properly i had called xolo service and even written to them but there was no reply. i recomend not to buy xolo product coz of very poor service                                 </span>", "<span class=\"review-text\">\n                                    I am purchase XOLO Q1000 before 3 moths but there are many problems in this phone  since i am purchase.I show this to service center but problem continuous arise.                                </span>", "<span class=\"review-text\">\n                                    I purchased XOLO Q 1000 sometime in Oct’13 (NOT from flipkart - probably if I could have bought it from flipkart - I could have saved my time jumping around after sales/service shops). <br>\n<br>\nI faced battery charging problem in July/Aug’14 (just in 10 odd months) – Battery doesn’t get charged even by 1%. Initially I thought it must be battery problem – so i got another battery – but I was wrong. With frustration I thought it must be the battery pin issue – I touched the battery pin and it broke. Later I went to service center – they said its hardware tampering and now it is out of warranty. I said OK – tell me how much it would cost to repair. After few days they said it would cost 2300/- for repairing the phone. I said OK and go ahead with the repair – while I asked them whether it would work after the battery pins are replaced – they said yes – as I said them the charging problem is before the pin got broken.<br>\n<br>\nIt almost 3 weeks now – and they are saying its a PCB problem - which would cost half of the phone cost.<br>\n<br>\nMy suggestion – Please don’t buy any XOLO phone. One of my office colleague also had same battery charging issue.<br>\n<br>\nI have now ordered RedMI – with the hope that I wont get all these issues.                                </span>", "<span class=\"review-text\">\n                                    Performance for operations is excellent, means software and processor are very very efficient.<br>\n<br>\nBut hardware is very weak part, handle with care. Damages if gets some strock.                                </span>", "<span class=\"review-text\">\n                                    this is a amezing handset<br>\ni think one discredit is <br>\nthis phone has no internet connectiviy on tata virgin and docomo<br>\nno update available                                 </span>", "<span class=\"review-text\">\n                                    I submitted my cell phone since 1.5 month back for certain issues having in it,but it is still in xolo factory(noida) and whenever I call them regarding status they all say the same thing that it is under repairing.                                </span>", "<span class=\"review-text\">\n                                    I am using this phone for 10 months now. No issue till now.<br>\n<br>\nIts display is just awsome.You will enjoy watching HD videos on it. Its touch-xp is also highly responsive. I have played high-end games like Asphalt8 on it.<br>\n<br>\nI have expanded it to 32GB, and minimal 2 GB free space in SD card. Still its performance is same &amp; no hanging etc.<br>\n<br>\nOverall...a readlly good phone from XOLO.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    This phone is excellent in camera, sound system, sleek design, display. But the battery goes down quickly even if we don't switch on the mobile data. And the most worrying thing is that after a month the phone starts hanging.                                 </span>", "<span class=\"review-text\">\n                                    Guys, please don't buy xolo devices. Its worst customer care is very annoying. If you get any problem in your handset or accessories you need to wait for months together. Please please don't give your money to them. They will not treat you as a customer and keep redirecting between service centers and customer care. You will loose your time. I have xolo q1000 handset and I got battery problem. They took my battery for replacement and its been close to 2 months. I haven't got my batery. Just wasting my time.                                 </span>"]},
{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    service after sales is bakwas, people should never buy mobile of this brand, it will better if you throw money insted of buying this one at least you know you are throwing own money                                </span>", "<span class=\"review-text\">\n                                    I am writing this review after 1 month of usage<br>\n<br>\nPositives:<br>\n<br>\nVery sturdy<br>\nSlim, fits easily into pocket<br>\nResolution is very good<br>\nTouch is very good<br>\nBattery is also decent on dual sim as well as roaming, get 24 hrs on Normal usage, i am not into games<br>\nHas not hanged even once in last one month<br>\nMusic quality is very good, i am using Apple earphone along with Poweramp app downloaded from Google play store<br>\nProcessor is fast<br>\nInternet browsing is also very smooth<br>\nEmails work well<br>\nLooks are decent<br>\n<br>\nWhat could have been better:<br>\nInternal memory and RAM<br>\nFlip cover should be included in the box, though bought good one from one of the online sites.<br>\nMagnetic sensor should also be there<br>\n <br>\nOver all a very good product from Xolo and at decent price.                                </span>", "<span class=\"review-text\">\n                                    1st of all Excellent service from Flipkart<br>\npros:- <br>\n1.Slim, awesome design, back cover is too good and also good to handle(some say that it might slip from hand but never happened wid me til now)<br>\n2.GPU is good.. can play many games without lag.<br>\n3.Provided screen cover is good<br>\n4.Good battery life.<br>\n5.Camera is good, pics are little grainy but looks good when not zoomed.<br>\n6.Has face lock feature. you can unlock mobile with it.. Excellent feature<br>\n<br>\nCons:-<br>\n1. Battery drain fast from 100 to 80% fast if not charged for extra half and hour after completing 100%.(Solved it with Easy battery saver app)<br>\n2. In settings it show external USB device , so XOLO should have provided us with on to go chord.<br>\n3.XOLO should have provided a flip cover as its very difficult to find for such a new design.<br>\n<br>\ni think Xolo will be one of the top five mobile manufacturers in world                                </span>", "<span class=\"review-text\">\n                                    Bought this on 27th June, so about 2 weeks now, and it works great. Better in every way than my Samsung Galaxy S2. If the phone does not have any quality issues for a year, I might just never buy a 'big brand' phone again.<br>\n<br>\nOnly complaint is the exposed camera which is pretty prone to damage. <br>\n<br>\nNote: I don't do any gaming at all.                                </span>", "<span class=\"review-text\">\n                                    It is the 17th day I am using this mobile called Xolo Q1000. Slight variation may be there from piece to piece.<br>\nPros and Cons so far after extensive use.<br>\nCons:<br>\n1. After watching a video for 5 odd minutes the piece gets heated up.<br>\n2. It takes 4-5 hours for complete charge (2100maH). Charger gets heated up on charging.<br>\n3. Output volume is low.<br>\n4. Auto Brightness adjustment is horrible.<br>\n5. Just @2.5GB internal+phone memory.<br>\n6. Battery drains up very quickly on surfing on the net, watching videos, playing games etc.<br>\n7. Video calling is a little bit disappointing factor.<br>\n8. Lack of good Customer Service.<br>\n9. Lack of Sensors.<br>\nPros:<br>\n1. Good  5 inch HD IPS LCD Capacitive Display. (no pixelation) 294 ppi.16.7 M Colours.<br>\n2. 1.2 GHz Quad Core MT6589 processor &amp; PowerVR SGX544 GPU is damn good.<br>\n3. Healthy 1GB RAM (640MB Usable). No lags. (Games run smooth)<br>\n4. 3G Speed is Magnificent. Maxing my internet connection.<br>\n5. Latest Android Jellybean installed in it.<br>\n6. Expandable to 32GB. I have added 16GB. Accessing memory is jubilant.<br>\n7. It is not bulky. Fits easily in the hand.<br>\n8. 8 MP AF Primary Camera with BSI Sensor with single LED flash and Full HD Recording is above average.<br>\n9. Dual SIM (3G+3G).<br>\n10. Bluetooth 4.0, 42 Mbps HSDPA,11 Mbps HSUPA.<br>\n11. HDR works well.<br>\nOn Light usage, it even lasts 3 days, 2 days for moderate and 15-16 hrs for heavy usage.<br>\nTalk-time is pretty good. White piece looks gorgeous.<br>\nReading content on it is fabulous.                                </span>", "<span class=\"review-text\">\n                                     phone is awesome...using this phone since one week<br>\n Display, camera, build quality is superb and battery backup is one day... <br>\n Only thing is volume of music  is little bit low other than that phone is superb and I'm loving it.....                                 </span>", "<span class=\"review-text\">\n                                    <br>\nPhone is too gud to use... Clarity and Display is awesome... Much better than Canvas HD<br>\n<br>\nI feel but to survey other options for everything including ur budget b4 making a purchase..............................................................................                                </span>", "<span class=\"review-text\">\n                                    Hands on Review for Q1000 (Black)<br>\n <br>\nA Premium Smartphone:<br>\nJust like all Xolo's made till now... even this 1 gets Beautiful design &amp; Build quality. Even if its a 5 inch phone its very Slim n perfectly fits in your palm. Most impressive part is the Display  which wont disappoint u.. Its Bright, Crisp and More Vivid.. A Good Display with very High Details.. This outlook Gives Q1000 a Premium Look.<br>\n<br>\nFor Performance Users:<br>\nohk.. Its Mediatek's 6589 Quadcore... i didn't try with loads of apps.. but it shouldn't give any lags even if u install 80+ apps with some always running in background and SGX 544 Graphics chip is not bad for Gaming ... You wont miss out your favorite Game.. i own Xolo A800 which has SGX 531 which is from the previous Generation of PowerVR series and i can Run all my favorite Games Properly. So, Graphics shouldn't create any problems in Gaming.<br>\n<br>\nFor Photographers:<br>\nIt does has 8MP cam and yes it does Shoot video in 1080p. But don't expect its Imaging like of Galaxy S3 or HTC ONE X+. Coz that can Disappoint u. 1080p video is not up to  mark...Sometimes Video gets blured. recording in 720p is only better. It gives  around 12,000 data rate &amp; 30 Frames per Second is enough for a good quality video output.<br>\n<br>\nStorage(Important for Gamers) :<br>\nInternal Flash storage is 1GB that's nice. u get only 2GB for phone Memory. Still When Installing very Big applications u wont have any problem, for SD card you may buy one nice 32GB class 10 Memory card and since it runs on Android Jelly Bean OS u may Swap it with your Phone Memory. so u can load as many Big Games or apps on ur Phone.<br>\n<br>\nAfter Sales Service:<br>\nSad but its True, as many have already said.. Xolo's Service really sucks... even on Xolo's Facebook Fan page they wont respond to you... They do respond to your Calls but it may be in vain. Still Fingers crossed. They are improving day by day. So i don't consider service as a Con.. <br>\n<br>\nOverall this phone can be a good buy at a price bucket of 15k, but it lacks a Magnetic Field Sensor. so compass app will act dumb when installed ;-) . Rest all assured.<br>\n<br>\ni rate it 4/5 as i am not satisfied with its Imaging capabilities. Imaging is same as Q800.                                 </span>", "<span class=\"review-text\">\n                                    I Waited for a long time to get Xolo Q1000 black colour and finally i got it. The display resolution is great when compared with other brand runnings models and also the hardware performance for high end games is very good, it delivers without hanging.... Camera clarity is really very good with 8 mega pixel. I feel the hear phone does not sound great as expected.                                </span>", "<span class=\"review-text\">\n                                    <br>\nHey guyz i got it the day after booking... Its just amazing...  Xolo rocks... Build quality is better than canvas hd.. Touch is vry vry good... Display isss so crispy... Video playback experience is just ossmmm.... Camera is comparable to DSLR... Games runnn smooth on this phone due to 286mhz gpu nd quad core... 1gb ram is sufficent.. User interface is android's own... Video wallpapers,wifi display and many more features to exploree... Sound quality is pleasant on both earphone nd speaker.. Just buy it... Dont thnk second tym... All-in one.. Amazing.. M loving it... Its my 4th android phone i used xperia L,galaxy s2,lg ootimus one believe me its better among all.....                                </span>"]},
{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    I bought xolo q1000  3 weeks back.The look of the phone is great.Camera quality is superb,Display is awsome,gaming on the phone is outstanding,no lags at all.Played dead trigger,contract kill2,Asphalt-7,sub way surfer etc.The graphics on the phone is superb.No lag at all.Movie watching on the phone rocks.......The sound of the phone is ok.Finally thanks to flip kart for delivering the phone within 3 days time........Thanks....                                </span>", "<span class=\"review-text\">\n                                    Writing this review after using the Phone for a week, researched a lot and bought this phone finally from retail store for 14k.<br>\nPros:<br>\n1.Processor &amp; RAM: I filled my mobile with high end games and apps but still performance is as good as a fresh phone with basic apps.<br>\n2.It has latest version of android OS v4.2 (jelly Bean)<br>\n3.Camera (8 MP) quality is way better than any mobile which comes for 14K , also secondary camera quality was awesome when I tried with skype.<br>\n4.Screen: Display quality is awesome as it is IPS screen.  <br>\n5.Battery: Here is the Hero, Guys It’s  5’ Inch IPS touch screen and battery backup is awesome.<br>\nWifi keeps running for the entire day still I get good backup. <br>\n<br>\nCons:<br>\n1.Mobile Heats up little bit (of course, U take any Phone there is alwayz)<br>\n2.Phone is slippery, because of Back Cover .<br>\n3.It takes 3 Hrs to charge completely (might be coz It has 2100 mAh)<br>\n4.It shows only 1.7GB Internal  memory ,Where is the rest (2 GB)?.<br>\n<br>\nMy overall rating for this phone would be 9/10, but I am giving 5 Stars. Better phone in 14K budget.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    i have bought this phone yesterday and the is just amazing, a far good from micromax canvas hd<br>\nand those who are saying that magnetic sensor does not work (who use it or who use compass)<br>\nthe best thing is that it supports 42.2 mbps speed of internet, gaming is good, screen is flawless,vivid sharp 720 p.i have not experienced any problem yet and battery backup is around 8 hrs,build quality is superb, and phonee is very slim.so for theis guys....                                </span>", "<span class=\"review-text\">\n                                    Hi guys Friday I bought q 1000 in Bangalore and phone is awesome...<br>\nDisplay, camera is superb and battery backup I'm getting one day...<br>\nAt this range this phone is really worth.... <br>\nOnly thing is hearing and ringing volume is little bit low other than that phone is superb and I'm loving it.....                                </span>", "<span class=\"review-text\">\n                                    1)XOLOQ1000 IS THE BEST MOBILE AT THIS PRICE IT HAS EVERY THING IN CAMERA(1080P WITH BSI HDR),GREAT DESIGN(DRAGONTRAIL GLASS),HARDWARE(QUAD CORE),SOFTWARE(ANDRIOD 4.2),DISPLAY(720P HD). <br>\n2)I AM GAMER SO I WANTED TO BYE THIS MOBILE BUT IT LACKED GYROSENSOR.<br>\nXOLOQ800 HAS A GYRO SENSOR BUT IT LACKED TOUGH GLASS AND MT6589M CHIPSET WHICH CANNOT RECORD 1080P VIDEOS.<br>\n3)XOLO PLS LAUNCH A MOBILE WHICH HAS THE FEATURES OF XOLOQ1000 WITH GYROSENSOR AND 2370MAH OR 3450 MAH BATTERY. PLS XOLO                                </span>", "<span class=\"review-text\">\n                                    I think xolo changed thier chipset in q800 with MT6589M (first MT6589 ONLY)<br>\n<br>\nso now  the option is only q1000 in xolo  I have just checked xolo site to check the chipset<br>\n<br>\neven im confused now to buy q800 or q1000<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    Received this piece 2 weeks back, <br>\n1. 1.2 GHz Quad core really makes it super fast<br>\n2. Good camera quality with features like panoramic view<br>\n3. 1280 x 720=294 ppi resolution and 5 inch screen : good video viewing experience<br>\n4. Good wifi connectivity <br>\n5. Navigator facility ( practically used navigator to travel from Tarnaka to BHEL in    hyderabad, worked well )<br>\n6. Audio is somewhat low<br>\n7. Have to charge the battery daily once<br>\n8. Struck once when switching between applications<br>\n<br>\nOverall rating is 4.8/5.0 <br>\n<br>\n                                 </span>", "<span class=\"review-text\">\n                                    First and foremost, the look of this phone is WOW! Really looks sleek and so stylish. The plastic used on this display gives a premium feel and the back panel is butter smooth and shiny.  It is scratch resistant and it has In plane switching and 5 finger touch. Overall build Quality is good.The Quad core processor makes working on this phone ultra fast. Scrolling screens is ultra smooth.<br>\nThe Q1000 is powered by the 1.2 Ghz Quad-core processor, and has the PowerVR SGX 544 Graphics chipset which is clocked at 286Mhz.The camera quality is very good. The HDR gives high clarity crisp images and image quality in low lighting is also very good. The front cam is also good. It serves well for video calling.The battery lasts a day on moderate gaming, browsing through wifi, music and video playback.<br>\nThis phone is worth the money paid.                                </span>", "<span class=\"review-text\">\n                                    1. Q1000 DOES NOT HAVE MAGNETOMETER AND GYROSCOPE where as its earlier version Q800 has it.<br>\n2. Canvas A116HD HAS conference call.<br>\n3. Is Q1000 a 16million color screen ? <br>\n4. Canvas has additional features like Night Mode, Creative and Shoot Stop-motion, Burst Mode, Zoom - 4x, White Balance, Color Effect &amp; Scene Mode.<br>\n5. Which is a better buy ? Q1000 should have come up without these deficiencies - then it was a clear option for a buy.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    First of all veryyy Verry congrats too Xolo braNd fo MakinG a wow phoNe.the phone z jUz aweOsme ..but lack of Ram n proccessor.ram should be 1.5 gb minimum.n processor must be above 1.5 GHZ....but except this two ...phoNe. Z juz wOw ......                                </span>"]},
{"link": ["/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=10", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=20", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=30", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=40", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=50", "/xolo-q1000/product-reviews/ITMDV6F7XPR3YSZD?pid=MOBDH6HC44DARDHX&rating=1,2,3,4,5&reviewers=all&type=top&sort=most_helpful&start=60"], "title": ["<span class=\"review-text\">\n                                    Poor service backup, attitude and approach of the customer case and servicing team. I purchased this product on 17th June and since then fighting with one and all for this defective piece. response is just like \"sarkari department\" where no one cares for the customer's difficulties.                                 </span>", "<span class=\"review-text\">\n                                    This phone seemed bad.. But it promised some amazing specs for the price. So I bought it anyway. Turns out, AMAZING. Have been using this phone for about more than an year now.<br>\nNo problems whatsoever. No lags, no spikes, no software problems. I have been recommending XOLO to everyone asking for an opinion.. BUY IT. Better than other new phones having almost similar price tags.                                </span>", "<span class=\"review-text\">\n                                    the flipkart was cheated me <br>\n<br>\nI AM purchased xolo q1000   so they will send  defective  mobile  so  asked  the  replacement  so the flipkart was  no replay  &amp;  can't respoance <br>\n<br>\nso asked the job sheet  so i am go to the service center so we will get the job sheet  so  job sheet was  send to flipkart  <br>\n<br>\nBut the fkipkart was it is not valid jobsheet was invalid  so  replacement was cancelled <br>\n<br>\nthease are the problem <br>\n<br>\nplease help the mobile was not worked                                </span>", "<span class=\"review-text\">\n                                    I purchased XoloQ1000 around 13200 INR some 6-7 month back.<br>\nIt's damn crap product.<br>\nthere's many fault in product, I sent it to service center where they repair it along with Micromax mobiles.  I was told it is repaired but when I checked, it was not repaired, simply they re-set the company setting.<br>\n<br>\nThey take around 3-4 weeks for repairing. Most of mobile are sent to Delhi for repairing where lots of dispute is going on. <br>\n<br>\nGood:<br>\nPicture quality:<br>\n<br>\nBad:<br>\nSpeaker sound are very low, mobiles gets heat up easily, battery does not last for 7-8 hrs, new battery is not available easily in market. Most of software does not work. <br>\nCompany response to customer care is very poor.<br>\n<br>\n                                </span>", "<span class=\"review-text\">\n                                    I br8 this fone from a local store at nearly rs 12500 .  i was very excited to use this fone as i knew the specs were awsome also the screen was full hd ips .thepicture reproduction was gr8.<br>\nbut as its said always dont judge a book by its cover<br>\ntill 1 month the fone was working fine but after that it started to give weird problems ..<br>\n1. the call volume was too low ,i tried evrything still same problem<br>\n2. audio jack was not working i tried many earphones still//<br>\n3.now the most imp thing BATTERY<br>\nwat to say abt battery ,, i had to carry my charger everywhere..1st the fone got charged to 100% in 20 mins then it dint even last for 10 mins ..the atter drained at the rate of 1% per 5 seconds or so.<br>\ni changed d battry from a local store still d same problem..<br>\nthen after loosing all hopes i went to xolo service centre<br>\nbefore me there werre more than 10-12 persons fightng for their phone .. the people in service centre are so rude and dont have any behaviour on hw to speak to customers.. i atlast gave my phone to them having little hope .. they told i will get the phone after 1 week.then they told after 1 more weeeks ... this way the phone was with them for more than 1 months .. the customer care number are always busy and they never help..<br>\ni somehw got the phone back and it was still not repaird <br>\ni lost all hopes and have br8 a good phone now frm a trusted company even if the rice is high still it is upto my exception... i am happy with my new phone now ..<br>\nthe shit known as xolo is R.I.P For me and is laying peacefully somewhere.<br>\nidont know where ..<br>\n<br>\nIT WAS A GOOD EXPERIENCE FOR ME TO<br>\nNEVER BUY XOLO PHONES <br>\nWHENEVER MY FRIEND ASKS ME TO SUGGEST A PHONE FOR HIM I TELL<br>\nANYTHING OTHER THAN XOLO<br>\n<br>\nTHANKS FOR READING AND HOPE U THINK TWICE BEFORE BUYING XOLO PHONES<br>\n<br>\nP.S AND YES THIS IS NOT MY FIRST XOLO PHONE I HAD XOLO A500 BEFORE THAT SUCKED TOO<br>\n<br>\nTHANKS FOR READING                                 </span>", "<span class=\"review-text\">\n                                    With this price it is a wonderful phone to have.<br>\nI have been using it for past 6 months, it never hanged or restarted.<br>\nI've been playing FIFA and it never lagged. with a wifi connection we can update and play with ease.<br>\nOverall thumbs up to XOLO.. the next level                                </span>", "<span class=\"review-text\">\n                                    Excellent product .... real value for money .... have been using it for more than 6 months without any problems                                </span>", "<span class=\"review-text\">\n                                    Very happy with the over all function. for people who fancy a S3 or nexus 4 but are on a  budget, expect for an Amoled screen and NFC, the Xolo Q1000 is the best pick, I picked it up for Rs 11999 with a 10% discount for using HSBC debit card ( extra Bonus ;-), however the price has reduced since then.<br>\n<br>\nCamera 8MP is amazing for this price, multitouch screen, touch sensativity gud, the black piece looks amazing would beat any highend phone on the looks,and many more function a normal user could.<br>\n<br>\nAnd the top it WS Retails does what it does best Delivery time always before time and flipkarts after sale service is excellant                                </span>", "<span class=\"review-text\">\n                                    Thanks for flipkart who deliverd the product with 3 days even the badlapur location..And product also is very good. nice mobile in 10k budget                                  </span>", "<span class=\"review-text\">\n                                    Received the mobile just in a day.<br>\nXolo models are taking over the market these days. very cool phone.<br>\nGot a extra scratch guard in the box                                </span>"]}]